{
    "title": "Daily Fountain",
    "year": "2025",
    "data": {
        "2025-09-01": {
            "date": "2025-09-01",
            "bibleText": [
                "Psalm 23:1-6"
            ],
            "topic": "WALKING THROUGH THE VALLEY",
            "content": "Life sometimes leads us through valleys of darkness, filled with challenges, losses, and uncertainties. Psalm 23, also known as the \"Shepherd Psalm,\" offers a message of God's care and presence during hardships, including lack and poverty. God, our Shepherd, provides for us so that we will not lack anything. He knows the terrain and will guide us to \"green pastures\" and \"quiet waters\" to replenish our spirit. We are encouraged to acknowledge our fears and challenges as the first step toward healing. The Shepherd promises to walk with us through the valley, not to remove it. God's presence is a constant source of comfort and strength, reminding us that we are not alone. The challenges will end, and a future filled with goodness, love, and an eternal dwelling place with God awaits. Holding on to this hope reminds us that our struggles are not the end and a brighter future awaits.",
            "prayer": "Heavenly Father, please help me walk through my challenges and struggles.",
            "action": null
        },
        "2025-09-02": {
            "date": "2025-09-02",
            "bibleText": [
                "Haggai 1:1-6"
            ],
            "topic": "MISPLACED PRIORITY",
            "content": "The people of Judah had returned from exile but neglected to rebuild the temple, preferring their own comfortable lives. They believed it wasn't the right time to rebuild the temple, but God saw their comfortable lives as misplaced priorities. The neglected temple symbolized their lack of devotion and appreciation for God's presence. Through the prophet Haggai, God challenged their lack of concern and urged them to consider their priorities and refocus their energy on rebuilding the temple. God reminded them that their lack of focus on rebuilding the temple resulted in a lack of blessing in their personal lives. We are asked if we are so focused on our comfort that we neglect things of greater importance, such as our relationship with God and service to others. While striving for a good life is important, neglecting our spiritual lives can lead to emptiness and a lack of fulfillment. Just as the people of Judah were called to rebuild the temple, God calls us today to take action and rearrange our priorities. We are challenged to \"Consider your ways!\".",
            "prayer": "Father, forgive me for preferring my comfort over your work and affairs, Amen! ",
            "action": null
        },
        "2025-09-03": {
            "date": "2025-09-03",
            "bibleText": [
                "Haggai 1:7-11"
            ],
            "topic": "CHOICES AND CONSEQUENCES",
            "content": "Today's passage from Haggai offers guidance for when we make our best efforts but don't see the desired results. The passage begins with God urging Israel to examine their actions and priorities. After they do this, God instructs them to \"Go up into the mountains, bring down timber, and build my house\" (v.8). God recommended a shift from observation to action because reflection without action can lead to stagnation. The Israelites experienced a lack despite their efforts, and God explained this as a consequence of their focus on personal gain while neglecting his house. The drought and hardship they experienced were the result of their neglect. When we face challenges or a lack of fulfillment, we are told to take time to reflect on our actions and priorities. Reflection should be followed by action, and we should identify the changes we need to make to align our lives with God's will and actively pursue them. If we are unsure where to start, we should seek guidance from trusted spiritual leaders, mentors, or faith communities.",
            "prayer": "Dear Lord, please give me the grace to retrace my steps and re-align my priorities, Amen! ",
            "action": null
        },
        "2025-09-04": {
            "date": "2025-09-04",
            "bibleText": [
                "Haggai 1:12-15"
            ],
            "topic": "TRANSFORMATIVE POWER OF OBEDIENCE",
            "content": "Today's text describes a turning point for the people of Judah when they obeyed the voice of the Lord their God (v.12). Having heard God's word, they shifted their focus and took action, highlighting the importance of not just listening but also acting on what we hear. God's response to their obedience was, \"I am with you, declares the Lord\" (v.13). The passage describes the positive outcomes of their obedience: their hearts were motivated to act and continue on the path of obedience with a deeper reverence for God. We are encouraged not to remain stagnant when we hear God's voice, but to take the first step toward what we believe God is asking of us, no matter how small. We are told to trust that as we move forward, He will be our guide and companion. Faith without action is like an unwatered seed, and we are encouraged to be the fertile ground where God's word can blossom into meaningful action. Small steps of obedience can lead to significant changes in our lives and strengthen our relationship with God. We are told to trust that He is with us and to take the first step toward living according to His will today.",
            "prayer": null,
            "action": "Reflect, Refocus and Realign your actions on building a lasting relationship with God."
        },
        "2025-09-05": {
            "date": "2025-09-05",
            "bibleText": [
                "Haggai 2:1-3"
            ],
            "topic": "THOUGH YOU MAY REMEMBER BUT DON'T DWELL ON YOUR PAST",
            "content": "In this passage, Haggai asks the people, \"Who is left among you who saw this house in its former glory?\" (v.3). This comparison between the magnificent former temple and its current, less impressive state might have brought feelings of regret and discouragement. However, God doesn't dwell on the past but encourages his people to move beyond it and focus on the blessings He promises in the present and future. It's okay to acknowledge and learn from the past, but dwelling on it can hinder our present and future growth. God's presence and blessings are available to us today, regardless of past experiences or circumstances. We are encouraged to focus on what we can control and how we can contribute to building something positive in the present. We shouldn't wait for ideal circumstances to begin building anew but should start with small, intentional steps, trusting that God will bless and guide our efforts. The text reminds us that while the past shapes who we are, it doesn't define our potential. By shifting our focus from comparing what is gone to present action and trusting in God's presence, we can embrace opportunities for growth and rebuild what is before us.",
            "prayer": null,
            "action": "Put your past in the past and focus on your present while trusting God for the future."
        },
        "2025-09-06": {
            "date": "2025-09-06",
            "bibleText": [
                "Haggai 2:4-9"
            ],
            "topic": "THERE'S A GLORIOUS FUTURE AHEAD",
            "content": "The Israelites felt discouraged by the temple's current state compared to its former glory. They might have questioned the value of their efforts, given the seemingly impossible task of rebuilding. In today's text, God offers reassurance despite their concerns. He encourages them to \"be strong\" and reminds them of his covenant, emphasizing his presence and unwavering support. The passage doesn't ignore the difficulties but offers a powerful promise: the shaking wasn't meant to destroy, but to prepare them for something new. This can be interpreted as a symbol of change and transformation, reminding us that God can use even difficult times to pave the way for something better. Verse 7 speaks of a time when \"the desire of all nations\" will come and fill the temple with glory, suggesting a future gathering of people from all backgrounds united in their reverence for God. The passage concludes with the promise that \"The glory of this latter house will be greater than the glory of the former house\" (v.9). Haggai's message reminds us that even in the face of difficulties and negative circumstances, God promises hope and a greater future glory. We are encouraged to hold onto this hope, embrace change, and actively contribute to building a brighter future, trusting in God's presence and guidance every step of the way.",
            "prayer": "Dear Lord, let your glory fill my path and shine on my dark path, Amen! ",
            "action": null
        },
        "2025-09-07": {
            "date": "2025-09-07",
            "bibleText": [
                "Romans 8:26-30"
            ],
            "topic": "PRAYING IN THE POWER OF THE HOLY SPIRIT",
            "content": "Prayer is an essential aspect of the Christian life and a successful Christian journey is almost impossible without a healthy prayer life. Prayer is not just asking, but an act of relating and remaining in relationship with God. It is how we spiritually commune and connect with our heavenly Father and is one of the most effective weapons of our warfare. For our prayer to be effective, it must be done correctly and for the right purposes. The only correct, appropriate, and divinely approved prayer is the one done in the power of the Holy Spirit. As humans, we are physically weak, which often prevents us from praying, even when we desire to. We are also emotionally weak and don't know the correct needs to pray for, sometimes praying for things to fulfill lustful desires, selfish gain, and the satisfaction of ego. To pray correctly, we need the assistance and guidance of the Holy Spirit. We need the Holy Spirit to do the actual praying for us. To gain access to the Holy Spirit, we must allow the Spirit of God to dwell in us as we manifest the fruits of the Holy Spirit daily. Praying in tongues is another way the Holy Spirit helps our weaknesses in prayer; therefore, we need to thirst and hunger for the gift of praying in tongues.",
            "prayer": "Heavenly father, according to your promise, fill me with the power of the Holy Spirit in Jesus' Name.",
            "action": null
        },
        "2025-09-08": {
            "date": "2025-09-08",
            "bibleText": [
                "Luke 1:39-55"
            ],
            "topic": "GOD'S PLAN AND YOU",
            "content": "Today is the 'Nativity of the Blessed Virgin Mary.' Mary took a significant and memorable part in the fulfillment of God's plan for the universe and humanity. Through her, the work of human salvation was achieved through Jesus Christ. She conceived and gave birth to the eternal King whose kingdom will have no end. Mary is a significant figure in the Christian faith, but she should not be idolized or viewed as an object of worship. Although only God knows exactly why she was so favored and chosen, some suggest it was because she was a chaste virgin with sound morality, was very humble and simple-hearted, and had the Lord God of Israel as her Saviour. Today, God still has plans for the world, but to fulfill them, He looks for people who are prepared and morally sound, humble, and dedicated to service. If we are willing and ready to take part in God's plans, we should follow the example of Mary's life of humility, holiness, and followership of God.",
            "prayer": "Lord, here I am: Take me, break me, remould me and use me - Amen.",
            "action": null
        },
        "2025-09-09": {
            "date": "2025-09-09",
            "bibleText": [
                "Haggai 2:10-14"
            ],
            "topic": "AVOID SPIRITUAL DEFILEMENT",
            "content": "In today's text, two questions were asked of the Priests. The first was whether a garment used to bear Holy Meat would become clean by touching Holy Meat, to which the answer was no. The second question was whether something unclean (by touching a dead body) can make something else clean (holy) become unclean, to which the answer was yes, meaning the unclean thing will defile a clean thing. The point emphasized by these questions is that it's easier to become unclean than to be made clean. As we interact with people and our environment, we need to be careful not to be defiled by immoral people we relate with. Some things that easily cause defilement are evil association and some often-overlooked sinful habits. The world today is full of wicked and sinful people whose lives are corrupted by habitual, ungodly, and criminal lifestyles. Some of these people give to charity, thinking they can use good works to erase their sins or make themselves clean, but this is not possible. The sure way to be cleansed from the guilt of sin is by honest confession, genuine repentance, and cleansing by the blood of the lamb.",
            "prayer": "Dear Lord, I rely on the blood of Christ for my cleansing. Help me daily to live by the power of your Holy Spirit and to remain undefiled, Amen.",
            "action": null
        },
        "2025-09-10": {
            "date": "2025-09-10",
            "bibleText": [
                "Haggai 2:15-19"
            ],
            "topic": "HOLY ZEAL TO DO GOD'S WILL",
            "content": "This text builds on the preceding one, showing the people of Israel as unclean because they were selfish, laboring to build their own houses and please themselves while neglecting God's house. God told them that even though they claimed to have repented by laying the foundation of the temple, they would still suffer and endure the consequences of their sins for a moment. However, after their repentance and restitution, their situations would begin to change for the better. The penalty for their sin would eventually be removed, and a time of peace and joy would soon come. Sometimes the difficulties and challenges we face are a result of our disobedience and indifference to God's work. For example, financial hardship, debt, and business decline can be the result of not paying tithes and offerings. Likewise, certain physical health challenges may be a result of unconfessed and hidden sin. The good news is that we have the assurance of God's forgiveness and total restoration if we consider our ways and return to Him in sincere repentance. After our repentance, a moment of patience is needed as the time of punishment gradually winds off and we are fully restored.",
            "prayer": "O Lord my God, give me the passion to obey you and to do your wish at all times, Amen! ",
            "action": null
        },
        "2025-09-11": {
            "date": "2025-09-11",
            "bibleText": [
                "Haggai 2:20-23"
            ],
            "topic": "GOD'S ULTIMATE PURPOSE: HIS ETERNAL KINGDOM",
            "content": "The message in today's passage was addressed to Zerubbabel, governor of Judah, when they returned from the Babylonian captivity. The prophecy speaks of a future time when God would destroy all human kingdoms on earth to establish an everlasting kingdom ruled by His Messiah. In this text, Zerubbabel is used as a symbolic representation of the Messiah, the Eternal King to come. As Zerubbabel was the initial leader of the exiles, Jesus, of the Davidic dynasty, will be the Deliverer of all who seek to escape from the captivity of sin. He will lead those who desire freedom from the bondage of sin and rule over them forever. The headquarters of his kingdom will be the new Jerusalem coming down from heaven and it will be established above all kingdoms. Jesus will reign as King from heaven over the whole universe. To qualify for His kingdom, one must be born again, set free from the slavery of sin, and walk by faith in Jesus and obedience to his leadership. This should be the ultimate goal of all believers.",
            "prayer": "Lord, set me free from the bondage of sin and make me fit for your eternal kingdom.",
            "action": null
        },
        "2025-09-12": {
            "date": "2025-09-12",
            "bibleText": [
                "Malachi 1:1-5"
            ],
            "topic": "A BURDEN FOR THE WORD OF GOD",
            "content": "The word \"burden\" comes from a Hebrew word that means 'to lift up.' Therefore, a burden for the word of God means 'lifting the word of God'. The author of the Epistle to the Hebrews reveals that in ancient times, God spoke through the prophets, but in these last days, He chose to speak to us through His Son, Jesus Christ. The word of God through the prophets and later through Jesus was in perfect harmony. The word is of two kinds: 'foretelling' and 'forth-telling'. To forth-tell is to reveal God's will, mind, law, and instructions through verbal or written proclamation. To foretell is to reveal God's plans, program, and purpose for humanity and the entire universe. Jesus Christ, who is the word of God, came into the world and revealed God's mind and law. He also made known God's plans and purpose for the whole world. He called everyone to repentance and faith in God and revealed the ultimate purpose and plan of God for the salvation of mankind. His followers are called to proclaim this gospel. When Jesus ascended into heaven, he handed over the work of proclaiming the word of God to us. It is a divine obligation for all true followers of Christ to bear the burden of preaching the word of God at all times and in all places, to the end of the world.",
            "prayer": "O Lord create in me holy zeal and burden to be an oracle of your word, Amen! ",
            "action": null
        },
        "2025-09-13": {
            "date": "2025-09-13",
            "bibleText": [
                "Malachi 1:6-14"
            ],
            "topic": "ABOMINABLE SACRIFICE",
            "content": "The Lord we serve is holy and should be honored, reverenced, and approached with the highest level of awe. His name should not be profaned. In this passage, the priests of the Lord were charged with sacrilege and disregard for holy things. They offered abominable sacrifices on God's altar, which was an abomination to God and His people. They offered animals that were torn, lame, sick, or maimed, which was a violation of God's prescription concerning offerings. Today, many of our altars are polluted with different forms of abominable sacrifices. Many priests, who should be custodians of the altar, are 'Strangers in the Sanctuary' because they have no salvation experience and their hands are soiled with sin. Many songs we sing and prayers we offer today are nothing but abominable sacrifices. When we offer polluted sacrifices to God, terrible consequences will follow, as seen in the case of Nadab and Abihu, who offered strange fire before the Lord. We can also learn from Cain, whose offering was rejected because it was faulty, unlike Abel's, which was accepted. Our offering will be acceptable if we first offer our bodies to God as a living sacrifice.",
            "prayer": "Lord, I offer my body a living sacrifice, let me be acceptable in your sight and help me to live to please you, Amen! ",
            "action": null
        },
        "2025-09-14": {
            "date": "2025-09-14",
            "bibleText": [
                "John 12:31-36"
            ],
            "topic": "THE RICHES OF THE CROSS",
            "content": "The cross is Christ's emblem of suffering, shame, and death. A believer in Christ should not be ashamed of his cross but should rather glory in it, as Apostle Paul said. Jesus also says, \"If any man will come after me, let him deny himself first, and take up his cross daily, and follow me\". There is a popular saying: \"No cross, no crown\". On the cross, Jesus Christ suffered beyond description, but He also conquered sin, self, satan, and all challenges that are man's problems, including curses, sicknesses, diseases, failures, and death. Furthermore, it was on the cross that Christ brought salvation to those who believe in him. Paul referred to 'the enemies of the cross' as those who do not walk according to the mind of Christ but according to the desires of the flesh. Jesus received the greatest honor because He surrendered himself, despised the shame, and died the meanest of forms of death. Paul said, \"God forbids that I should glory except in the cross of our Lord Jesus Christ\". Any man identified with the cross of Christ has the world and its evil desires crucified with him and is risen to a new life of holiness and righteousness with him. A crucified life is a dignified and glorified one, and we are encouraged not to dodge the cross but to carry it gallantly, as the blessings attached to it await us.",
            "prayer": null,
            "action": null
        },
        "2025-09-15": {
            "date": "2025-09-15",
            "bibleText": [
                "Romans 8:8-23"
            ],
            "topic": "LIFE IN THE SPIRIT",
            "content": "Life in the Spirit is a life in which the Spirit of God dwells and consequently directs the life of the believer who has genuinely surrendered his/her life to the Lordship of Jesus Christ. Such a life is empowered by the Holy Spirit to overcome the lustful desires of the flesh and can mortify the deeds of the body. The presence of the Spirit of God in a person serves as proof that they are a child of God. The Spirit of God bears witness with our Spirit that we are children of God, and such are heirs of God and joint heirs with Christ. Being joint heirs with Christ qualifies believers to enjoy the great inheritance that we have in God. This inheritance is manifested in two ways: first in the glory that shall be revealed to the world and second in the suffering the believer will have to go through for the sake of his faith. There is no condemnation to believers who are in Christ Jesus and who walk not after the flesh but after the Spirit. If you are not a part of this group, you can become a member by surrendering your life to Jesus Christ and asking Him to become the Lord of your life and thus put the Spirit of God inside of you.",
            "prayer": "Dear Lord I submit my heart to you afresh, please come into my heart and fill me with your spirit in Jesus name, Amen.",
            "action": null
        },
        "2025-09-16": {
            "date": "2025-09-16",
            "bibleText": [
                "1 Corinthians 1:17-25"
            ],
            "topic": "GOD'S POWER AND WISDOM",
            "content": "In our text, Apostle Paul makes it clear that the Gospel, which is Jesus Christ, is the power of God. God's power is to reconcile and restore man, and can only be traced back to Jesus Christ, who has been since the foundation of the world. Paul also described Jesus Christ in the last part of verse 24 of our text as the wisdom of God. Power and wisdom are essential in life for anybody who wants to succeed here and beyond. We will be powerless, foolish, and unfulfilled if Jesus Christ is absent in our lives because worldly wisdom is foolishness to God. Therefore, in all our ambitions in life, we must acknowledge the Lord Jesus Christ in our lives so our existence can be meaningful and impactful. The level of our academic attainment or exposure is vanity if Jesus Christ is not in our lives. Since the power and wisdom of God is Jesus Christ, then anyone aiming to see God at the end must do away with sinful living and surrender all to Jesus Christ, who is the power and wisdom of God.",
            "prayer": "Oh Lord, turn my foolishness to wisdom through Jesus Christ, Amen!.",
            "action": null
        },
        "2025-09-17": {
            "date": "2025-09-17",
            "bibleText": [
                "Philippians 3:17-21"
            ],
            "topic": "LIVING WITH PURPOSE",
            "content": "Today's passage is part of Paul's letter to the Philippians, where he addresses concerns about unity, joy, and Christian living. In verses 15-16, he calls for the Philippians to follow his example and those living faithfully. In the same way, we are to follow the examples of Saints in their commitment and faithful living. We must intentionally live with the purpose of modeling our lives to follow the pattern of Jesus Christ. Verses 17-21 expand on this, contrasting those who follow Christ and those who live for earthly things. Apostle Paul presents a clear choice before the believers - either to live for this world or the Kingdom of Heaven. He further challenges all believers to examine their priorities and motivations. Our priorities determine who we are. As heavenly citizens, our focus must be on the things of heaven. We must note that true fulfillment comes only from belonging to God's eternal kingdom and living for that purpose alone. This doesn't mean that we will neglect our earthly responsibilities but rather we find our ultimate meaning in Christ and live a balanced life, using all resources around us to fulfill the purpose of getting to heaven. We hope that though our bodies may be limited, we await a future transformation, becoming like Christ in glory. This provides comfort and hope, especially in difficult times.",
            "prayer": "Dear Lord, please grant me grace to love you and live for your purpose only, Amen!.",
            "action": null
        },
        "2025-09-18": {
            "date": "2025-09-18",
            "bibleText": [
                "John 12:31-36"
            ],
            "topic": "I WILL DRAW ALL MEN UNTO MYSELF",
            "content": "Imagine this scene: Jesus, surrounded by a crowd, speaks boldly about his upcoming death. The world saw the crucifixion of Jesus as a defeat but Jesus saw it as a means of victory. Instead of lamenting his fate, He declares with confidence \"If I be lifted up, I will draw all men to myself\". Christ's lifting here is not of the humiliating death on the cross but of a deeper meaning, symbolising Jesus' purpose - to offer himself as a sacrifice for the salvation of mankind. This reveals the heart of God's love and redemption plan. Jesus didn't shy away from his crucifixion, He saw it as the transformative power of sacrifice, and not humiliation. In the earlier chapter (8:12), Jesus described himself as \"The light of the world,\" without which anyone who walks, is in darkness. Phos is a Greek word for light, meaning anything that produces brightness. Light is anything that reveals things or makes them manifest. Darkness is the absence of darkness. According to John Piper, \"The light of Christ is the brightness of God shining on the retina of the human soul\". He is the light to both the Jews and the Gentiles. Isaiah describes the desperate and hopeless state of a man without Jesus, the Light. Beloved, will you be drawn to this wonderful love? Have you tasted Calvary? Today is the day, tomorrow may be too late!.",
            "prayer": "Father, I submit to your love take my heart let it be thine own.",
            "action": null
        },
        "2025-09-19": {
            "date": "2025-09-19",
            "bibleText": [
                "Philippians 2:5-11"
            ],
            "topic": "WHAT A GREAT HUMILITY",
            "content": "In reading today, Christ demonstrated the greatest form of humility by having laid aside the majesty of his former appearance as God and coming down in man's likeness to redeem us from our sinful nature. He emptied himself, was shed of the honours and glories of the upper world and clothed himself with human nature. One would have thought that the Lord Jesus if He would be a man, should have been a prince, and appeared in splendour. But quite the contrary, He took upon himself the form of a servant. His whole life was a life of humiliation, meanness, poverty, and disgrace; He had nowhere to lay his head.",
            "prayer": null,
            "action": null
        },
        "2025-09-20": {
            "date": "2024-09-20",
            "bibleText": [
                "Galatians 3:13-14"
            ],
            "topic": "A GREAT REDEEMER",
            "content": "Apostle Paul in our text reminds us that though the Law is holy and perfect, everyone who does not keep the Law perfectly is cursed by it. This is because no one can, on his or her ability, obey the Law perfectly. There were over 600 laws the Jews had to keep so as to be right in the eyes of God; breaking one commandment put a person under condemnation. Therefore, achieving salvation through obedience to the Law is fruitless. As a result, all who tried to live by the Old Law were under a divine curse. The good news is that Christ, through his death on the cross, provided a way out of this curse, making the way for us to regain the favour of God. He did this by becoming a curse for us - for it is written, 'Cursed is everyone who is hangs on a tree.'. The curse of the law fell on Christ on our behalf so that the righteousness of God could fall on us, though we did not deserve it. He took away our sins and curses so that the blessings of Abraham might come to the Gentiles through him. Every man is condemned and cursed but the redemptive grace of Jesus brought us all into favour and blessings of God, and we can access this grace by believing in the Lord Jesus and living by faith to receive the blessings that accompany faithful observance of the law.",
            "prayer": "Lord Jesus, I thank you for offering yourself to save me, I now ask for the grace to live for you for the rest of my life, Amen!.",
            "action": null
        },
        "2025-09-21": {
            "date": "2025-09-21",
            "bibleText": [
                "Matthew 9:9-13"
            ],
            "topic": "HARVESTING LIKE THE MASTER",
            "content": "Matthew was a Jew appointed by the Romans to collect tax. He collected taxes from the citizens as well as from merchants passing through town. At the time, tax collectors were expected to take a commission on the taxes they collected, but most of them overcharged the people and kept the excess to themselves. As a result of this, they were hated by the Jews because of their reputation for cheating and because they supported Rome. Despite this, our Lord Jesus Christ still went for Matthew, a man who would have been regarded as an oppressor and a terrible sinner, by the Jews. Jesus hurt his reputation among the religious elites to reach out to those who were lost. We must all follow our Master's example by spreading the gospel to all without any discrimination - the poor, immoral, lonely and outcast, and not just the rich, moral, popular and powerful. We should not be afraid to reach out to people who are living in sin. God's message changes people and He is concerned for all people, including the sinful and hurting. Matthew, on hearing the call to abandon all and follow Jesus, got up and followed, leaving the so-called lucrative career, without any regret. Sometimes, the decision to follow Christ requires difficult or painful choices. But like Matthew, we must decide to leave behind those things that will keep us from following Jesus.",
            "prayer": "Lord Jesus give me your spirit to love all and reach them with the gospel of peace.",
            "action": null
        },
        "2025-09-22": {
            "date": "2025-09-22",
            "bibleText": [
                "1 Corinthians 13:1-13"
            ],
            "topic": "LOVE: A MORE EXCEPTIONAL WAY",
            "content": "In chapter 12, Paul gave evidence of the Corinthians' lack of love in the use of spiritual gifts. Our text today shows that love is more important than all the spiritual gifts exercised in the body of Christ. Our text also describes God's kind of love, which is unselfish and goes against our natural beliefs and way of loving. This most excellent way is the way of kindness, longsuffering, and enduring evil, injury or provocation. In this way, pride and vainglory are subdued and there is no room for envy, hatred, malice, or revenge. Love is the fulfillment of all the laws of God and once we allow the love of God to spread over us, our hearts will be transformed and we will receive the impartation of the agape love. However, this will only be possible if we allow the light of the gospel to bring the knowledge of Christ to inspire faith and hope in us which will help us to set aside our natural desires so that we can love and not expect anything in return. Thus, the more we become like Christ, the more love we will show to others. This will help us to understand that love is the greatest of all human qualities and an attribute of God himself.",
            "prayer": "Dear Father, please pour your love into my heart.",
            "action": null
        },
        "2025-09-23": {
            "date": "2025-09-23",
            "bibleText": [
                "Malachi 2:1-9"
            ],
            "topic": "THE LIPS OF A PRIEST OUGHT TO PRESERVE KNOWLEDGE",
            "content": "Malachi in our text offers a plain message directed at the priests of Israel. This message also holds valuable lessons for all of us called to leadership roles, whether within the church or in our daily lives. God entrusted the priests with the task of being guardians and teachers, ensuring God's instructions reached the people. However, God laments that the priests have scattered his instructions \"to the wind\" and \"turned away\" from the covenant. This neglect has consequences. God threatened to \"curse their blessings\" and \"spread dung over their faces\". As leaders, religious or secular, we hold a great responsibility. We are entrusted with guiding others, shaping their understanding, and setting an example. When we fail to uphold our responsibilities, the consequences can be great. We risk misleading those we are called to serve, and our influence can be tarnished. Our passage today highlights that the Levite priests of old were committed to their calling and served with integrity. Today's leaders are challenged to reflect on old-time faith and leaders, follow their example, embody the values they preach, and guide others with honesty and dedication. Our actions speak louder than words. If we don't live by the principles we advocate, we \"cause many to stumble in the law\".",
            "prayer": "Dear God, help me to be faithful stewards of your word and grace, Amen!.",
            "action": null
        },
        "2025-09-24": {
            "date": "2025-09-24",
            "bibleText": [
                "Malachi 2:10-17"
            ],
            "topic": "BROKEN VOWS",
            "content": "The passage opens by reminding the Israelites of their shared origin and covenant with God. Despite this shared history and commitment, the people had been \"betraying one another\" and exhibiting disloyalty, both to their fellow humans and to God Himself. God described divorce as something He \"hates\". This statement speaks to the broader importance of honoring commitments and maintaining the sanctity of relationships. Whether it applies to marriage, friendships, or our covenant with God, breaking faith has significant consequences. The passage urges individuals to \"guard yourselves in your spirits\" and to avoid \"breaking faith\". This requires vigilance and self-awareness. We must be mindful of the promises we make and the impact our actions have on others. In what ways do you ensure you are living up to your commitments, both to others and to God?. Have there been times when you have broken faith with someone? How can you work towards healing those relationships? How can you cultivate a more positive and trusting relationship with God, even when faced with challenges or doubts?.",
            "prayer": "Almighty God, forgive me for my broken promises and unfaithfulness. Help me to strengthen the relationships in my lives and cultivate a spirit of integrity.",
            "action": null
        },
        "2025-09-25": {
            "date": "2025-09-25",
            "bibleText": [
                "Malachi 3:1-5"
            ],
            "topic": "AN ENCOUNTER FOR REFINEMENT",
            "content": "Our text today starts with a powerful image describing a messenger who will be sent to prepare the way for the Lord. This messenger has been identified to be John the Baptist, who proclaimed the coming of Jesus Christ in the New Testament and prepared the people for an encounter with Jesus. The eventual coming of the Lord is described as a refining fire and a purifying soap. This language speaks of judgment and transformation. Judgement in that every sin will be revealed and condemned. It is important to remember that God's refining fire is not meant to destroy us but to remove impurities and reveal the precious metal within. Just as a refiner carefully heats gold to separate it from dross, so does God work in our lives to remove sin and selfishness, leading us closer to his holiness. Through this refining process, we can become offerings that are pleasing to the Lord. Encountering Jesus through the purifying soap of his blood cleanses us from all sin and transforms our lives to please him while being ready for the Second Coming of the Lord.",
            "prayer": "Lord help me to embrace your refining fire, knowing that it leads to greater purity and a closer relationship with you.",
            "action": null
        },
        "2025-09-26": {
            "date": "2025-09-26",
            "bibleText": [
                "Malachi 3:6-18"
            ],
            "topic": "CALL TO COMMITMENT",
            "content": "Today's text presents a powerful dialogue between God and his people. God declares his unwavering character: \"I am the Lord; I do not change\". Moreover, He challenges the people's unfaithfulness, their questioning of his justice, and their disobedience in offerings and tithes. The verses highlight the importance of commitment and faithfulness through the concept of tithes and offerings. This isn't just about material things, but also about recognizing that everything we have comes from God and expressing our gratitude and trust through our actions. However, in the midst of the warnings, God offers hope. He invites the people to return and to test his faithfulness through generosity. He also promises abundant blessings if they return. Imagine a farmer questioning the value of planting seeds due to past droughts. Our passage reminds us that God, unlike seasons, remains reliable. He is the ever-present source of blessings, waiting for us to cultivate our trust through faithful actions. Are we questioning God's promises like the people in Malachi?. Are we holding back and doubting his provision?. Maybe it's time to plant a seed of trust through an act of generosity, big or small. Remember, it's not about gaining God's favour, but about aligning our hearts with his love and experiencing the joy of giving.",
            "prayer": "Lord, forgive me my doubt and disobedience and help me renew my commitment to you to experience the blessings of your faithfulness.",
            "action": null
        },
        "2025-09-27": {
            "date": "2025-09-27",
            "bibleText": [
                "Malachi 4:1-6"
            ],
            "topic": "A DAY OF RECKONING AND RENEWAL",
            "content": "Malachi's final chapter paints a clear picture of contrasting destinies. The wicked face a day of judgment and destruction while those who fear and honor God experience hope and restoration. This passage offers a powerful message about choices, consequences, and the unshaking love of God. The metaphor of a burning oven serves as a clear warning against arrogance and evil. It reminds us that our actions have consequences and that choosing the wrong path leads to destruction. In contrast, God offers a beacon of hope - the sun of righteousness which signifies salvation, healing, and joy for those who remain faithful. It reminds us that God's love and grace are ever-present, offering new beginnings even in the midst of darkness. If we can accept the grace through the Lord Jesus Christ, we can escape judgment and destruction and allow the sun of righteousness transform our hearts and deliver us from the danger ahead. Are you ready to face the judgement or will you surrender to Jesus and enjoy total freedom with the fullest of Joy? Make the choice today!.",
            "prayer": "Lord, grant me the wisdom to discern between right and wrong, the courage to choose your path, and the strength to endure life's challenges with faith.",
            "action": null
        },
        "2025-09-28": {
            "date": "2025-09-28",
            "bibleText": [
                "Romans 12:9-21"
            ],
            "topic": "A FABRIC OF LOVE",
            "content": "This passage paints love as a textile woven with threads of different colors and textures. It describes a vibrant picture of Christian living, where love is the central thread binding everything together. The beauty of Christianity can only come out when we exhibit genuine agape love of Jesus Christ. Love is not just superficial affection, but a deep, authentic commitment to the well-being of others. It goes beyond personal gains and seeks the good of the community. It is the love which manifests in concrete actions like honouring others, offering hospitality, and sharing with those in need. However, as we obey the will of God in showing this love, we are going to face persecution, suffering, and conflict. As Christians, we are called to respond with blessings, perseverance, and a commitment to peace. Recognizing our limitations and associating with everyone, regardless of their status, brings unity and breaks down barriers. We are not called to retaliate, but to conquer evil with good, choosing forgiveness and patience over anger and revenge.",
            "prayer": "Dear Lord, empower me to live according to your teachings. Grant me the strength to choose love, even when it's difficult.",
            "action": null
        },
        "2025-09-29": {
            "date": "2025-09-29",
            "bibleText": [
                "Matthew 10:6-19"
            ],
            "topic": "WALKING THE MISSION PATH",
            "content": "Our text describes the commissioning of the Disciples by Jesus on a challenging mission to the lost sheep of Israel. This commissioning shows the disciples' responsibility within their community and reminds us to focus on our spheres of influence and share the Gospel with those around us. We are all on a mission to our community and are instructed to avoid material possessions but rather put our trust in God's provision as we live with a spirit of detachment as Jesus instructed the Disciples. Jesus described the mission as sending a sheep to the wolf's den - preparing our minds that we are going to face potential rejections, persecution, and danger. Yet, Jesus equipped the disciples with clear instructions and powerful promises and their message was one of hope and healing, proclaiming the arrival of the Kingdom of Heaven. Rejection and persecution were expected, but the disciples were not to respond negatively. This reminds us to stand firm in our faith while maintaining peace and love, even in the face of opposition. Despite the challenges, we are promised guidance and strength from the Holy Spirit. This emphasises our reliance on God's power and presence in our journeys.",
            "prayer": "Teach me Lord to be faithful to fulfil the mission you have sent me on, Amen!.",
            "action": null
        },
        "2025-09-30": {
            "date": "2025-09-30",
            "bibleText": [
                "Revelation 12:7-12"
            ],
            "topic": "STANDING VICTORIOUS IN THE FACE OF SPIRITUAL WARFARE",
            "content": "This passage from Revelation presents a dramatic battle between good and evil, symbolised by Michael and the dragon. This shows us the reality of spiritual warfare. There is an ongoing intense spiritual struggle between good and evil, over our soul and destiny. Our battle is not against the flesh but against forces of darkness represented by devils and demons. Their main aim is to make sure we are not on the path to heaven and that our faith is wrecked. Thanks be to God for the ultimate victory of God and his people, offering hope and inspiration despite the challenges we are facing in this present world. We are not alone in this battle, Christ is with us, as is the host of heaven. We must recognise the power in the blood of Jesus Christ as a force that will bring the ultimate victory of God's power and love over evil and darkness. The power of the blood of Jesus emphasises that our victory is rooted in the blood of the Lamb, representing the sacrifice of Jesus and its power to overcome sin and death. The people who overcome are those who stand firm in their faith and testimony, even in the face of persecution and death.",
            "prayer": "Dear Lord, please give me strength and courage to face my battles with faith and hope.",
            "action": null
        },
        "2025-10-01": {
            "date": "2025-10-01",
            "bibleText": [
                "Romans 13:1-8"
            ],
            "topic": "PERFORM YOUR CIVIC RESPONSIBILITIES",
            "content": "I once heard of a church that had bypassed the PHCN meter to enable them use electricity without paying for it. Sometimes, people do this because a member of that church works with the power distribution company, or that they have one form of 'connection' or the other. I have heard of wives of officers in the military or para-military driving without vehicle or driver's license. And the boast is that \"no one will harass you; you're the wife of an officer.\". While one may get away with such because of 'connections', it is not right for a disciple of Jesus to behave so. We do the right things because we belong to the Lord, who is not disorderly; we do the right things because it is the right thing to do; we do the right things because we fear God and for the sake of our conscience. Verse 5 of our text stresses it: Therefore, you must be subject, not only because of wrath but also for conscience sake. Note the word 'must'; it is actively playing a crucial role there. So, you must do what is good. You're supposed to have, as up to date, it is Christian to do so. Remember that Jesus was not disorderly; as a matter of fact, He paid his taxes, and even paid for Peter.",
            "prayer": null,
            "action": "Rise and make amends where necessary!."
        },
        "2025-10-02": {
            "date": "2025-10-02",
            "bibleText": [
                "Colossians 1:1-8"
            ],
            "topic": "FAITHFUL WITNESS",
            "content": "As I sat listening to testimony after testimony of the faithful labours of Brother Gideon, who had served the Lord for many years in the ministry, I wondered if I will have such a testimony at the close of my pilgrimage here on earth. And to say the truth, I knew the things being said of the brother were true. My experience relating with him in the past thirty-eight years was not different. I knew I could easily say the same things about him; he was quite selfless. He had served creditably in the ministry and now he was gone. In verse 2 of our text, Paul was clear that he was writing \"To the saints and faithful brethren in Christ who are in Colosse.\". Can this be said of you where you're living?. Are you faithfully following the Lord?. One of the touching things is that this was being said about an entire congregation. I wonder if there are congregations today that the Holy Spirit can bear 'a wholesale testimony' that all in the local assembly are 'faithful brethren.'. And yet, this was said of men, flesh and blood, not spirits. The journey to having an assembly of faithful brethren starts with each member deciding to be a faithful follower of Christ, as I believe Gideon was. If you are faithful and I am faithful, then we will have a faithful assembly.",
            "prayer": "Lord, May I indeed be a true soldier of Christ.",
            "action": null
        },
        "2025-10-03": {
            "date": "2025-10-03",
            "bibleText": [
                "1 Timothy 3:1-7"
            ],
            "topic": "QUALIFIED TO SERVE?",
            "content": "Many today desire to be leaders in God's house. In our communion, it seems many in the holy orders see the bishopric as the ultimate that must be aspired for, and campaigned for, if necessary. The word 'bishop' in our passage can mean overseer. While it is not wrong to desire to be a leader in God's house, it must never be at all costs. It is interesting to note that there are qualifications for leaders, as we see in today's passage. For one, the person must have a good testimony (within and outside the church), and there are ways to measure this. For one, he must be gentle, not quarrelsome. It may be easy for many not to be quarrelsome outside. But what about at home?. A quarrelsome man at home, often in disagreement with his wife and other family members, is not qualified to lead God's people. A man known for quick temper should also not aspire for leadership office in God's house. Moreover, one who is desiring the office of a bishop must be humble. Pride is what ruined Satan and can also destroy a Christian leader. Pride has to do with an open consciousness of your perceived worth; it has to do with an over-emphasised opinion of one's self. The testimony of Bishop Samuel Ajayi Crowther's service points to the direction of a humble service, rendered in one of the most trying circumstances. Dare we be different?.",
            "prayer": "O, for a humble heart I pray.",
            "action": null
        },
        "2025-10-04": {
            "date": "2025-10-04",
            "bibleText": [
                "Colossians 1:9-14"
            ],
            "topic": "FILLED WITH THE KNOWLEDGE OF GOD'S WILL",
            "content": "I wondered what to do with a young man who had just committed his life to Christ. How do I find time in the midst of many personal engagements and activities to disciple him?. What times should I schedule to study and pray with him?. I found that what the Holy Spirit will have me do first is to bend my knees on his account. I needed to begin to earnestly pray for him, committing him and his new found faith to the One who alone could keep him. It was in doing this that I found God giving me an insight into how to raise him for the kingdom. Paul's first reaction to the news of the faith of the Colossians should be an instruction to us on what to do and how to proceed when there is a new believer or group of new believers: \"For this reason we also, since the day we heard it, do not cease to pray for you, and to ask that you may be filled with the knowledge of His will in all wisdom and spiritual understanding\" (v.9). Have you learnt to pray this prayer for yourself and others?. A believer that is filled with the knowledge of God's will as well as spiritual understanding will do well.",
            "prayer": "Dear Lord, help me to genuinely pray for myself as well as others.",
            "action": null
        },
        "2025-10-05": {
            "date": "2025-10-05",
            "bibleText": [
                "1 John 1:8-2:6"
            ],
            "topic": "LIVING OUT HIS LIFE",
            "content": "I stood at the entrance of the mechanic workshop where my car was being fixed. A young spare parts dealer walked up to me and asked: Is that car being fixed by Emma, yours?. I said yes. He immediately said, \"You're lucky o!\". I asked what he meant and his answer surprised me. He informed me that they (spare part dealers) have an understanding with the mechanics; they add their own 'cuts' to the prize of parts. But according to him, Emma will refuse, insisting that the real prize be told the customer. All this while, Emma did not hear the conversation but it increased my respect for his decision to live as the Christian I knew him to be. John was specific about what will make the world know that we are true followers of Christ: \"He who says he abides in him ought himself also to walk just as He walked\" (v.6). The acid test for a disciple of Christ is living Christ's life. The world ought to see the character of Christ being lived out by us; in a sense, we are the letters that Jesus has written to the world. They ought to see Jesus in us as they did in Antioch and called believers there Christians. Are you living out his life?.",
            "prayer": null,
            "action": null
        },
        "2025-10-06": {
            "date": "2025-10-06",
            "bibleText": [
                "Colossians 1:15-18"
            ],
            "topic": "CHRIST, OUR ULTIMATE JOY",
            "content": "I know of a believer who was a bit tense as he approached his first-degree exams; he wanted to graduate with honors, at least a second-class upper division. He eventually made it and discovered he felt no different. He thought a Master's degree would give him that boost; he finished his masters and discovered the world did not change. A Ph.D might just be the magic he needed; but he finished that also without feeling on top of the world. As he discovered, only a proper relationship with Christ gave him the inner joy he needed to move through life. This experience has been the story of many. And the reason is very simple: He (Jesus) is before all things, and in him alone all things hold together (v.17). Even life itself cannot hold together outside him. The pursuit of worldly goods and achievements do no guarantee ultimate happiness; political power does not guarantee it either. Same goes for fame. We were created for him, and only in him can we ever find fulfillment. Determine today to pursue a proper relationship with Christ; it is your only guaranteed means of finding fulfillment in this world. All other things will fail.",
            "prayer": null,
            "action": "Determine to stand on Christ, the solid ground; all other ground is sinking sand."
        },
        "2025-10-07": {
            "date": "2025-10-07",
            "bibleText": [
                "Colossians 1:19-23"
            ],
            "topic": "CHRIST, OUR ULTIMATE JOY",
            "content": "Sometimes, I wonder why non-believers do the things they do; I wonder how someone will not see that a certain habit, character or lifestyle, is harmful. I have wondered why some people dress terribly, for example, and not see that it reduces the perception of their dignity. I did this until it dawned on me that but for Christ, I will not be different. I will not be worse than the people I wonder about. I believe this goes for all of us who are the disciples of Christ. The way Christ has so washed our lives and changed our values makes us forget that we are the way we are only because He washed and changed us. He killed the appetite for sin in us, making us hate what non-believers seem to like.",
            "prayer": null,
            "action": null
        },
        "2025-10-08": {
            "date": "2025-10-08",
            "bibleText": [
                "Colossians 1:24-29"
            ],
            "topic": "DISCOMFORT FOR THE SAKE OF CHRIST",
            "content": "As I waited for the ferry to arrive, I thought of the dangers of crossing the river in high current. I thought of the last time I passed this way and the ferry engine died in the middle of the journey. I thought of the terribly bad road I have to travel in for hours before getting to the more manageable section of the road back home. I had gone to preach and this was the only reason I was going through this experience. Paul the apostle knew this kind of hardship, even more. He endeavoured to preach Christ in places where He had not been named; he (Paul) was in danger at sea, on land and even among the Jews; all for the gospel. Paul's conviction and attitude to all his suffering is worth noting, worth emulating and worth preaching in today's world filled with the gospel of no suffering, only physical prosperity. Hear him clearly saying: \"I now rejoice in my suffering for you...for the sake of His body, which is the church, of which I became a minister\" (vv. 24-25). Would you consider suffering discomfort for the sake of Christ a let-down?. Can you endure hardship for the sake of the gospel?. What is your understanding of true spiritual prosperity?. Remember, the mystery Paul talked about is 'Christ in you, the hope of glory'.",
            "prayer": "Lord, may I yield to all you have for me in the gospel, even if it involves some discomfort.",
            "action": null
        },
        "2025-10-09": {
            "date": "2025-10-09",
            "bibleText": [
                "Colossians 2:1-10"
            ],
            "topic": "WALK IN HIM",
            "content": "In a very credible sense, one of the clearest things as one goes through the New Testament is the fact that you lose your independence once you become a Christian. As you sign up to follow Christ, be prepared to let go your own ideas and principles, your own interests and pursuits, your own biases and attachments. You must now walk in him, live in him and live for him alone. Anything less is not acceptable. Hear Paul again firmly insisting: \"As you therefore have received Christ Jesus the Lord, so walk in Him, rooted and built up in Him and established in the faith\" (vv. 6-7). A few implications emerge here as what is required once you receive Christ: (i) Walk in him: You are no longer allowed to walk/live the way you want; your steps must now be clearly taken in Christ, not according to the expectations of the world system. Your life can no longer be lived to fulfil the expectations of men, not even your own personal expectations, but the expectations of Christ. Are you living according to his expectations?. (ii) Rooted and built up in him: The roots of your private and public choices must now be in Christ; the considerations for your choices must now be him. (iii) Established in the faith: You must be formed now in the faith, not on the expectations of the world system.",
            "prayer": "Lord, please, have your way in me.",
            "action": null
        },
        "2025-10-10": {
            "date": "2025-10-10",
            "bibleText": [
                "Colossians 2:11-17"
            ],
            "topic": "JESUS, GREATER THAN 'YOUR VILLAGE PEOPLE'",
            "content": "One of the common expressions today in Nigeria is 'your village people'. This has somehow become the valid explanation of many concerning any challenge they are going through. Even when one does not want to believe this of what s/he is going through, others insist on his behalf that is the only logical explanation for passing through any undesirable experience. My worry is that this belief has created fear in the minds of many a Christian; it seems to be elevating the powers of evil; and it gets Christians preoccupied with activities to stop 'village people' rather than bearing a authentic witness for Christ. Is this not a contradiction?. What Scripture clearly teaches, point in a very different direction: \"... having wiped out the handwriting of ordinances against us, which was contrary to us\" (v. 14). No sin is greater than the blood of Christ; his blood can cleanse any sin. No power, covenant or curse is greater than the cross of Christ; his cross brought us victory over all the powers of the evil one. Next time you hear, 'your village people are pursuing you,' insist that according to Scripture, it is goodness and mercy that is following you. Your life in Christ is insured if you will rise up in faith and live for him.",
            "prayer": null,
            "action": "Insist that no weapon formed against you shall prosper."
        },
        "2025-10-11": {
            "date": "2025-10-11",
            "bibleText": [
                "Colossians 2:18-23"
            ],
            "topic": "CHRIST, THE ULTIMATE REALITY",
            "content": "The Colossian Christians needed to be warned by God in this letter, especially in regard to philosophical and religious appearances and perceptions. In verses 16 and 17 of this chapter, Christians are warned not to let anyone judge them by physical standards of food or religious festivals and celebrations. They were not to be manipulated by outward religious appearances or high-sounding but empty philosophical wisdom of men. All these are not the reality but a shadow. The real substance of spirituality is found in Christ alone, not in some religiosity that does not have any real substance, or high-sounding philosophies, or any other manifestations and human achievements. The only hope for a sound spirituality recognised by God is for one to get connected and reconnected with the \"head\", Christ Jesus. No amount of religiosity, no quantity of human efforts can make a person right before God. Only connection with Christ - a total submission to the Lordship of Jesus - can achieve that. Jesus himself said \"... apart from me you can do nothing\" (John 15:5). Real life, real wisdom, real relationships, and real spirituality can only be found in Christ.",
            "prayer": "Lord, thank you for making me understand that real life and real wisdom can only be found in you. I acknowledge you as my Lord and my reality, Amen.",
            "action": null
        },
        "2025-10-12": {
            "date": "2025-10-12",
            "bibleText": [
                "1 Peter 4:7-11"
            ],
            "topic": "LIVING WITH THE END IN MIND",
            "content": "There is an unfortunate way in which some people live today. They live in ignorance of the fact that life is temporary and passes on quickly. However, despite this ignorance, everyone comes to their end, with time. God never meant for life on this earth to be permanent. Unfortunately, many live life with the philosophy that their stay on earth is permanent. Ultimately, they will be disappointed one day when they realise that their lives have come to an abrupt end. They will feel worse when they find themselves standing to be judged by God in regard to the life they chose to live on earth. Knowing that life is temporal and the end of all things draws near, how then should God's people live in the here and now?. (i) God's children must be always alert, sober-minded and prayerful. They are not to be carried away by the material things of this world, or by the tricks of Satan. (ii) They must live to show acts of love, which ought to manifest, among other things in: hospitality without grumbling, use of gifts to serve others, deliberately employing the words they speak as instruments of God in edifying others. They must also avoid careless utterances that destroy people, while they invest their lives in service to God and God's people. Finally, they must do everything to bring praise and honour to Christ always.",
            "prayer": "Lord, help me to live my life and do all things always remembering that the end is near, Amen!.",
            "action": null
        },
        "2025-10-13": {
            "date": "2025-10-13",
            "bibleText": [
                "Colossians 3:1-4"
            ],
            "topic": "A LIFE RAISED WITH CHRIST",
            "content": "The born-again life of a Christian has been described in certain ways. In Colossians 2:20, Paul says that the Christian \"died with Christ.\". In our text today, he says that Christians have been \"raised with Christ\" (v.1). In other words, when a person genuinely gives his/her life to Christ, he/she first of all dies to the worldly attitude to life; and is then raised with Christ to the heavenly attitude towards life. Being born-again involves a drastic disconnection in the attitude towards the world and its manner of living, and a another drastic connection in attitude towards heaven and its manner of living. Attitude is what makes the difference!. Those who are truly raised with Christ and are genuinely born-again demonstrate that new status by their lifestyles, passions and desires. On the other hand, those who are not born-again, or who only pretend to be, are identified by the way their passions and desires cling to the world and all it offers. Such people are often willing to compromise godly moral standards in order to gain the treasures of the world. Jesus says 'What shall it profit a man if he gains the whole world, and loses his own soul? Or what will a man give in exchange for his life?' (Mark 8:36-37) .",
            "prayer": "Lord, I acknowledge that nothing in this world is more valuable than my soul. Help me to always set my heart on the things of heaven, Amen!.",
            "action": null
        },
        "2025-10-14": {
            "date": "2025-10-14",
            "bibleText": [
                "Colossians 3:5-11"
            ],
            "topic": "THE EARTHLY NATURE",
            "content": "Yesterday we considered what it means to die with Christ and be raised with him, which is the born-again life. In our text today, the Lord shows to us very clearly the way and manner of life lived by those who are not \"dead and raised\" with Christ, but whose hearts are set on this world and its treasures. The characteristics of an earthly-minded person include sexual immorality, impurity, lust, evil desires, greed, anger, rage, malice, slander, filthy language, lies, etc. Apostle Paul describes these same negative worldly qualities when he wrote on the \"acts of the flesh\" to the Christians at Galatia (Gal. 5:19-21). This is a very serious matter as the wrath of God will come on those who live by such ungodly practices. Child of God, do not allow yourself to become a candidate of God's wrath. Rather, rid yourself of such ungodly habits by embracing the love of God in Christ Jesus. Faith in Christ and submission to his Lordship over your life can save you and lift you above the wrath of God that is coming upon the children of disobedience.",
            "prayer": "Lord, I disengage from every hidden sin in my life. Take them away from me and nail them permanently to your cross, and give me a brand-new life, Amen!.",
            "action": null
        },
        "2025-10-15": {
            "date": "2025-10-15",
            "bibleText": [
                "Colossians 3:12-17"
            ],
            "topic": "THE WAYS OF THE TRULY BORN AGAIN",
            "content": "Earlier in the chapter, Paul pointed out some of the practices of those who are not genuinely born-again, whose hearts are set on the earth and its worldly ways. In a similar way, our passage today explains to us that the ways of those who are truly born-again, are obviously different. The practices of heavenly-minded believers manifest themselves in much more admirable and commendable qualities. Note the following: (i) They joyfully and sincerely clothe themselves with compassion, kindness, humility, gentleness, and patience towards others. (ii) They are quick to forgive, always remembering that they themselves are also beneficiaries of God's mercy and forgiveness. (iii) They seek for peace always, and are themselves at peace with all people and in all circumstances. (iv) They are a thankful people, in all circumstances and at all times. (v) They cherish the gospel of Christ and are always affected by it, and they also seize every opportunity to use their gifts and talents to build up others in Christ. (vi) They are always motivated to do all for Christ's glory and for Christ alone. (vii) Their hearts are always ruled and motivated by the love of Christ. Does this picture reflect your life as a Christian? If not, do something about it!.",
            "prayer": "Lord, mat the virtues of the Christ life find expression in my life, Amen!",
            "action": null
        },"2025-10-16": {
            "date": "2025-10-16",
            "bibleText": [
                "Colossians 3:18-21"
            ],
            "topic": "THE FAMILY THAT HONOURS GOD",
            "content": "There are certain behaviours, attitudes and practices that make Christians and their families unique and admirable. Our passage today tells us how best we can conduct ourselves towards each other in family relationships in a way that will attract glory for Christ. When we obey these principles, we will build godly, healthy and joyful families, and by extension a better and healthier society. First, wives are instructed to submit themselves to their husbands, and this is fitting and pleasing to the Lord. In a world filled with twisted cultural mindsets and the theories of feminism, it is becoming increasingly hard for many wives to obey this principle. But if a Christian family must glorify God, this principle is a must. Note that the wife is called upon to submit herself to her husband willingly and not by force. Her action should be a free-will decision because she loves the Lord. A wife cannot truly love Christ without showing that love through submission to her husband. Second, husbands are to love their wives the way Christ loved his Church and gave himself up for her (Eph. 5:25). This is a self-giving and self-sacrificing kind of love. Moreover, Christian children are to obey their parents ; and parents are to raise and train their children with firmness, patience and love.",
            "prayer": "Lord, may my family truly glorify you, Amen! ",
            "action": null
        },
        "2025-10-17": {
            "date": "2025-10-17",
            "bibleText": [
                "Colossians 3:22-25"
            ],
            "topic": "GOD, MY EMPLOYER",
            "content": "In continuation of our meditation on God's instructions for Christian households, we focus today on employees. At the time that this letter was written, different forms of slavery were part of the cultural practices of the world, especially the Roman world ; so, it was common to find slaves who had converted to Christianity from pagan backgrounds. God was challenging them to see their condition of slavery as an opportunity to showcase their faith as Christians. They were therefore instructed to be obedient to their masters in everything, as long as it did not go against the principles of their faith. They were not to give themselves to eye-service, but be sincere and diligent in carrying out their duties. They were to always view their work as an opportunity for service, not to men but to God, knowing that God is the ultimate rewarder. Slavery may not be in practice among us today literally as it was then, but what about our work ethic today? Do you grumble, murmur and complain in your place of service?  Bear in mind that although you may be in the employment and on the pay roll of men today, the ultimate employer of every man is God. Therefore, do everything as unto God.",
            "prayer": "Lord, help me to do all things to the glory of your name, Amen! ",
            "action": null
        },
        "2025-10-18": {
            "date": "2025-10-18",
            "bibleText": [
                "2 Timothy 4:5-13"
            ],
            "topic": "CONFIDENT OF ETERNAL DESTINATION",
            "content": "Paul died for his faith during one of the persecutions that broke out in Rome under Emperor Nero. Our passage is very clear that even before his death, Paul was aware that the time was drawing to a close. Yet, he was not shaken by fear as he faced his coming end ; he looked forward to his end with such a quiet confidence and glowing anticipation of his heavenly destination. Paul gives the answers to the questions of how you can be equally assured and confident of the prospect of eternity and your final destination  to young Timothy. (i) Do not be confused or distracted by the attractions of this world or by the situations you face as a Christian. (ii) Endure every hardship that comes to you as a result of your faith in Christ. Every genuine faith in Christ must be tested by the fire of troubles. (iii) Be a faithful evangelist and a witness to the gospel of Christ wherever you find yourself. (iv) Be a faithful and trustworthy minister of Christ in your calling and vocation. (v) Christianity is warfare against sin and Satan, therefore, fight your good fight. As a Christian, when you practise and maintain your faith in this way, you can be confident that your everlasting crown will certainly await you in heaven.",
            "prayer": null,
            "action": null
        },
        "2025-10-19": {
            "date": "2025-10-19",
            "bibleText": [
                "2 Corinthians 5:1-7"
            ],
            "topic": "LIVING BY FAITH, NOT BY SIGHT",
            "content": "God's creation of the entire universe and everything in it was a fragile process. This includes the nature of the human body. Paul uses 'earthly tent' to describe the human body. In contrast, he also describes the new body to be received in eternity in stronger and more enduring terms , saying 'we have a building from God, an eternal house in heaven, not built by human hands' (v.lb). While it is good and necessary to take good care of this earthly physical body, it is, however foolish, to do so while neglecting your soul which has eternal value. Many today treat their physical bodies like a god, but treat their souls like a trash bin. Those who live by sight alone see their body and the physical things of this world as permanent and final, therefore, they invest their devotion, time, resources and loyalty to them, forgetting that time and circumstances will happen to these things and they will fade away. But those who live by faith in Christ cherish their souls and invest in every possible way to maintain its health and sanctity, making it ready for its heavenly destination.",
            "prayer": "Lord, help me care well for my spirit.",
            "action": null
        },
        "2025-10-20": {
            "date": "2025-10-20",
            "bibleText": [
                "Colossians 1:1-6"
            ],
            "topic": "GOD'S HOLY PEOPLE",
            "content": "Paul described the Christians at Colossae as 'God's Holy people'. They are also described as 'faithful brothers and sisters' (v.2). There are certain qualities that are noticeable in the Colossian Christians, qualities that each of us should seek to be known by. The first is faith in Christ (v.4a). This made these Christians to stand out as distinct before God and before men. No one can come to God and be accepted by him without faith in Christ. Another quality of this people was their love for all God's people (v.4). Faith in Christ can only be genuine and effective if it expresses itself in unconditional love towards people. Furthermore, these were a people whose hope was heaven. To be recognized as holy before God, we must constantly live with eternity in view. We are not to live carelessly or recklessly, but each day loving God and man and seeking to please God in all our ways.",
            "prayer": "Dear Lord, please help me live to please you, Amen! ",
            "action": null
        },
        "2025-10-21": {
            "date": "2025-10-21",
            "bibleText": [
                "Colossians 4:7-14"
            ],
            "topic": "BE A TEAM MEMBER",
            "content": "Partnership and team work are important requirements in ministry. When members of the body of Christ work together, it reflects or shows the very nature of the triune God and how He designed his Church to function. During his missionary exploits, Paul didn't do it all alone but had several companions who offered help and encouragement all the way. His ministry was effective and successful because of the helpful people whose commitment did not shake. His team members had different backgrounds (Jews and Gentiles), and played different roles (messengers, helpers, physicians, prayer warriors, slaves, burden bearers). Each played a significant role and Paul commended them publicly. Beloved, you need to be part of a team when it comes to doing God's work in whatever local church you attend so as to fulfil God's purposes for his church. God wants to use you and all you need to do is submit yourself to him. Don't complain about your shortcomings because there is no such thing as one who is more significant or qualified than others in a team. God uses the efforts of each team member in equally important, unique and special ways. You can't live the Christ-centred life on your own as alone.",
            "prayer": "Dear Lord, give me the grace to serve faithfully as a team member, Amen! ",
            "action": null
        },
        "2025-10-22": {
            "date": "2025-10-22",
            "bibleText": [
                "Colossians 4:15-18"
            ],
            "topic": "UNITED IN SERVICE",
            "content": "Using four critical commands, Paul concluded his epistle with a charge concerning the ways that the Colossians themselves were to serve (vv. 15-18). He communicated a desire for fellowship with the churches in Colossae and Laodicea ; then a desire for the circulation of his letters between the churches (highlighting the importance of the Word in the life of the church) ; an encouragement to a specific member of the church (Archippus) concerning the call of God upon his life so that he would fulfil it ; and a final exhortation regarding prayer - that they should pray for him in his prison chains. From these final verses, we learn much about how we are to build up unity with one another in God's service. Believers in Christ should love and cooperate with one another, sharing the precious word of God within the church family and among the brethren! This tells the rest of the world that Jesus is our Lord. We are to pray for, support, encourage, respect and exhort one another towards faithful service and fulfilment of our calling. So much of the success of God's work and that of his faithful workers, depends on our prayers. With this and the grace of God in our midst, the church will flourish.",
            "prayer": "Dear Lord, unite your church in your service through Christ our Lord, Amen! ",
            "action": null
        },
        "2025-10-23": {
            "date": "2025-10-23",
            "bibleText": [
                "Acts 15:12-22"
            ],
            "topic": "GRACE IS AVAILABLE NOW",
            "content": "Today is the Feast of St. James of Jerusalem. He was the brother of our Lord (Mark 6:3), yet Jesus' brothers didn't initially believe in him or accept his ministry (John 7:5). James believed only after the resurrection - when Jesus showed himself to him. That was enough to convert him. James realised that he had been wrong all along. He later became a leader in the church at Jerusalem, so much so that Paul referred to him as a pillar of the church. God used James to do a lot for his church in Jerusalem. James contributed a lot towards the resolution of the controversial issue at the Jerusalem Council. His leadership was steady, mature, and based on Scripture. James' story shows what God's grace can do in a person's life. It can take an unbeliever and turn them into a devoted servant of the Lord as it did to James (from doubting Jesus to leading the most influential church in Jerusalem and guiding and defending God's people with God's Word). If Jesus did it for James, He will do it for them too. Only let your knees be bent in prayer on their behalf. Pray that they will be saved while God's grace lasts.",
            "prayer": "Dear Lord, please rescue the unbelieving and the perishing by the same grace you extended to James, Amen! ",
            "action": null
        },
        "2025-10-24": {
            "date": "2025-10-24",
            "bibleText": [
                "Proverbs 28:1-9"
            ],
            "topic": "CHRISTIAN BOLDNESS",
            "content": "One of the wonderful moral tools God puts in a man is the conscience. A guilty conscience is a relentless pursuer, driving a person to flee from imaginary threats and to avoid unseen eyes. This is the case of the wicked who engages in praising wickedness, oppression, and injustice because of selfishness. Even when no one is actually threatening them, the wicked, prompted by a guilty conscience, shame and fear of judgment, become fearful and suspicious of everyone. This happens to them because God is not pleased with them. God's righteous ones are however confident and bold - standing even when persecuted for Christ's sake. They are bold as a lion because God upholds them. They know that his grace is bigger than any mistake, and his forgiveness more powerful than any guilt. You can be bold and courageous by turning to Christ who sets free from all sin, guilt, shame and fear. Jesus washes from all wickedness and makes the righteous face anything with confidence and boldness. Dip yourself in the truth of God's love. When you understand the depth of his love for you, guilt loses its grip. When you realise that you are covered by his grace, fear dies.",
            "prayer": "Father, help me to be bold on account of your provision, strength, grace, and help.",
            "action": null
        },
        "2025-10-25": {
            "date": "2025-10-25",
            "bibleText": [
                "Proverbs 28:10-20"
            ],
            "topic": "IT PAYS TO FEAR GOD",
            "content": "The fear of the Lord is the beginning of wisdom, and to fear God is to recognise sin for what it is and to want to be on the right side of God's judgment. The one who fears God lives with the mindfulness of his absolute holiness and hatred of sin. They also honour God with their lives, recognising that they will stand before him to be judged based on their faithfulness as believers (2 Cor. 5:10). Thus, they do not lead God's children astray (v.10) , do not boast in their wealth (v.11) , praise righteous deeds, are just and fair, and administer justice to all when in leadership (vv. 12, 15). They quickly confess and forsake their sins (v.13). The man who fears the Lord will be honoured in due time by the Lord, if not in this life, then in eternity. Those who fear the Lord sow seeds of life and will have a glorious harvest with abundant spiritual fruit and rewards. They will have access to every spiritual blessing and eternal riches in Christ. The fear of God begins with accepting Jesus Christ as your Lord and Saviour. Those who harden their hearts and reject Christ will find disaster and eternal catastrophe as they are judged on the last day. Their eternity will be misery in hell. Therefore, fear the Lord and walk in his ways while you have the opportunity.",
            "prayer": "Lord, may I truly fear you, Amen! ",
            "action": null
        },
        "2025-10-26": {
            "date": "2025-10-26",
            "bibleText": [
                "Romans 8:12-17"
            ],
            "topic": "INHERITANCE THROUGH SUFFERING!",
            "content": "This passage reminds Christians that we are children of God and therefore, heirs of God who will receive God's inheritance. God owns everything, and his children come into the inheritance of what He owns. This is a great promise - the security of the child of God. Because of our adoption by God, we are now children of God, with an assurance of freedom from fear (v.15) , intimacy with the Father (v.15) , assurance of belonging (v.16)  and inheritance with Christ (v.17). Those who belong to Christ have the Holy Spirit. And the Holy Spirit testifies that we are children of God. The same Spirit convicts us of our sins, humbles us to hate sin and makes us cry out in need of the Father. If you belong to the Father, you have an eternal inheritance with him. Therefore, you must live a transparent and honest life. Let it show that you are a child of God. Hate sin; in fact, fight against it. God's children do not continue to sin. Remember that the path to glory was not without its sufferings for Jesus (Luke 24:26). But if you suffer with him, you shall also be glorified together with him (v.17). As co-heirs with Christ, the only way to come into your immeasurably great inheritance is through suffering. Therefore, you endure!",
            "prayer": "Lord, awaken the witness of the Holy Spirit within me and cause me to hate sin in my life, Amen! ",
            "action": null
        },
        "2025-10-27": {
            "date": "2025-10-27",
            "bibleText": [
                "Proverbs 28:21-28"
            ],
            "topic": "TRUE VERSUS FALSE RICHES",
            "content": "A popular scheme in the world today is the get-rich-quick scheme! Even in the church, prosperity-preaching anchored on Luke 6:38a can be heard more frequently than the call to repentance. It is used as a lottery ticket or investment that guarantees huge returns. But today's passage teaches that it is wrong to rush after shortcuts to become rich, only to fall into errors (vv. 21-23). Such shortcuts include favouritism, bribery, neglecting the needy, taking advantage of others, stealing, etc. These all result in false riches and have consequences. True riches come from honest hard work and showing kindness and love towards others in need. Be careful that you do not run into trouble. Be on guard against all kinds of greed and shortcuts to wealth. Such wealth is false and does not last. Seek to be rich toward God thereby laying up treasure for yourself in heaven. Through honest hard work and love, built in your heart for the poor and needy, God will supply your needs (Phil. 4:19) ; and this will not be taken away from you. Instead of pursuing wealth that does not satisfy, seek first to be rich in the kingdom of God and to trust him to meet your needs.",
            "prayer": "Dear Father, deliver me from greed and the love of money, Amen.",
            "action": null
        },
        "2025-10-28": {
            "date": "2025-10-28",
            "bibleText": [
                "Jude 1:1-6"
            ],
            "topic": "STRIVE FOR THE FAITH",
            "content": "Today we celebrate the feasts of Saint Simon and Saint Jude, two of the twelve apostles. From the little we know about them, we can find an example of what it means to love one another and to strive for the faith. They went on to be faithful witnesses of the saving power of Jesus. They were not so famous but they faithfully followed the cause of the Lord Jesus. They started out as regular people like you and I, but through their relationship with Christ, they went on to do great things - striving for the one, true and only faith. Now Jude charges us to contend for the true faith which source is the word of God. Those who pervert the word of God or refuse to believe it, shall be condemned. Beloved, there may be many people around you that are not truly saved. But while you pray for their salvation, do not judge them. Just heed the warnings of Scripture and contend for the faith as the apostles did. If this faith matters to you, and if it defines you, and it is a priority for you, you will be obliged to defend it. You must strive for the faith that He has blessed us with as we wait eagerly for His coming.",
            "prayer": "Father, help me to be zealous and faithful in making known your love and mercy, Amen! ",
            "action": null
        },
        "2025-10-29": {
            "date": "2025-10-29",
            "bibleText": [
                "Proverbs 29:1-6"
            ],
            "topic": "TURN FROM WILFUL SIN",
            "content": "To be stiff-necked is to refuse to ignore warnings about sin, and disregard God's Law by continuing in rebellion against him. Those who do so are at peace with their sins - having being trapped by it. They get flattered by sin (v.5)  and think they can be happier if they govern themselves (v.2) , comfort themselves, even if through wastages (v.3)  and find their own practical solutions to their problems. They feel smart and self-sufficient. But they forget the consequences of such continued rebellion against God. If you have been warned about sin in your life - listen to that warning! Never ever ignore God's repeated warnings. God is not happy with those who are stubborn and rebellious to his warnings. He is only being patient with you to lead you to repentance. However, those who continue to resist God after many calls to repentance, those who see their rebellion clearly and yet continue willfully in sin, will finally receive the consequences of sin. Jesus patiently calls you to submit to his authority - to turn from sin and obey his word. His desire is to bless you.",
            "prayer": "Lord, please deliver me from all wilful sin and help me submit to your authority, Amen! ",
            "action": null
        },
        "2025-10-30": {
            "date": "2025-10-30",
            "bibleText": [
                "Proverbs 29:7-16"
            ],
            "topic": "CHOICES HAVE CONSEQUENCES",
            "content": "Every choice we make in life has consequences which are due rewards or just punishment for the choices and decisions. Many of our troubles occur because we make choices based on unreliable authorities such as culture, tradition or emotions. Solomon tells us that the wicked will flourish, grow or prosper, for a time, but eventually, they will meet their downfall. They will receive the consequences for their sinful choices someday. Unfortunately, some Christians are frustrated as it appears the wicked seem to get away with their sins without consequences. Some wonder why they should abstain from evil. But remember, there is always a consequence to your choices. If you choose to be wicked, God will deal with you in his time and in his way. If you choose to ignore God's ways, hurting those around you, eventually, you will face the consequences of your choice in this life or in eternity. God will surely deal with those who choose to sin. Nobody will ever escape the consequences of their choices (Psa. 37:1-6). When you see sin multiplying, run from it and trust God to deal with it in his time and in his way. Find a way to stop the wickedness by focusing on your own choices - making sure they are in line with God's word. Choose righteous living and stand for it.",
            "prayer": "Dear Lord, help me to always make choices in life that will glorify your name, Amen! ",
            "action": null
        },
        "2025-10-31": {
            "date": "2025-10-31",
            "bibleText": [
                "Proverbs 29:17-27"
            ],
            "topic": "FEAR GOD, NOT MAN",
            "content": "One of the burdens of every man is the fear of his fellow man. We so much fear man's disapproval, rebuke and discipline. In fact, it's such that many would rather offend God than man, and seek man's approval than God's. This fear can so weaken us not to take action and keep us silent when we should speak. It feels powerful, but its power is deceptive. That's why Proverbs 29:25 tells us, 'The fear of man brings snare, but whoever trusts in the LORD shall be safe.'  This means that the fear of man is an evil trap. That is why both Moses and Jesus commanded us to love and fear the Lord, not man (Deut. 6:5; Matt 22:37). Remember, you obey the one that you fear and you ascribe the most authority to the person you fear most. As a Christian, you are to fear God and seek the eternal reward and approval that He gives. Fear the terrible eternal curse of God's disapproval more than insignificant man's disapproval. The fear of the Lord is safe because He really is God and He alone can destroy both the soul and body in hell. Lay aside every fear of man by confessing your fear of man as sin to God, and repent. Don't fear what people think, fear what God thinks.",
            "prayer": "Dear Lord, deliver me from the fear of man and help me to fear, love and trust you always, Amen.",
            "action": null
        },
         "2025-11-01": {
            "date": "2025-11-01",
            "bibleText": [
                "2 Peter 1:1-11"
            ],
            "topic": "FRUITFUL CHRISTIANITY",
            "content": "On All Saints' Day, we reflect on the lives of the canonized saints. These are holy persons believed to have special grace in character and ministry. In our church, the Apostles and those who believed the Lord when He was in flesh on earth are especially celebrated as Saints. These saints serve as examples for us who are still in the race. We must end in heaven as Saints triumphant. Our salvation is an entry point in our Christian life, and we are required to go on to maturity. Our consecration should be a daily process. The basic faith actions listed in the text, which include learning to know God better, developing perseverance, doing God's will, and loving others, must be a continual part of our Christian life. Our salvation does not depend on good works, but it results in good works.",
            "prayer": "Help me Lord to show devotion to the things that will help me to grow in my faith, Amen! ",
            "action": null
        },
        "2025-11-02": {
            "date": "2025-11-02",
            "bibleText": [
                "John 5:21-29"
            ],
            "topic": "RESURRECTION OF THE DEAD",
            "content": "All Soul's Day is a day set aside to celebrate the life and ministry of other saints who have died and are now awaiting the resurrection morning. In today's passage, Jesus speaks about the events of the End Time, including the resurrection of the dead in Christ and His ability to both resurrect and judge them. Unbelievers will also be resurrected. The kind of resurrection each person experiences depends on the life they lived before death. We should learn to subject our lives and will to the will of God. Those who believe in God and His word will not be subjected to judgment.",
            "prayer": "Help me Lord to totally subject my life and my will to you, Amen! ",
            "action": null
        },
        "2025-11-03": {
            "date": "2025-11-03",
            "bibleText": [
                "1 Thessalonians 4:13-18"
            ],
            "topic": "GLORIOUS ASSURANCE",
            "content": "Death is a reality. Apostle Paul addressed the Thessalonian Christians' concern about the fate of their fellow believers who had died by pointing out that every Christian has a glorious hope. The Christian hope is based on the return of Jesus Christ. Those who are dead will rise on the resurrection day. The greatest asset you have as a Christian is your faith, and you must sacrifice everything to keep it. Let the assurance of hope He gives strengthen your faith in God.",
            "prayer": "Rock of ages, cleft for me and let me hide myself in thee. ",
            "action": null
        },
        "2025-11-04": {
            "date": "2025-11-04",
            "bibleText": [
                "Proverbs 30:1-10"
            ],
            "topic": "CONSIDER THINGS THAT MATTER",
            "content": "God is infinite, and certain aspects of His nature will always remain a mystery. We can only know God as He has revealed Himself to us, mostly through His words. To attempt to add to what has been written is unacceptable; God will rebuke anyone who tries because they are a liar. The writer of the text asks God to make him honest and not to allow him to be too poor or too rich. This shows a desire to be focused on his purpose for living. Devote time daily to know God more and more through His word. Perfect peace and joy only come from living a God-approved life.",
            "prayer": "Help me Lord, to remain faithful in my fellowship with you, today and always, Amen! ",
            "action": null
        },
        "2025-11-05": {
            "date": "2025-11-05",
            "bibleText": [
                "Proverbs 30:11-17"
            ],
            "topic": "THE SIN OF INGRATITUDE",
            "content": "Our text gives a true picture of our present generation, where people think they can do whatever they wish without consequences. It is a generation that curses its father and does not bless its mother. It is also a generation that is pure in its own eyes but is not washed from its filthiness. The passage deals with the sin of ingratitude, which is common in these last days. Ingratitude manifests when our love for God and our fellow humans grows cold. We honor men and appreciate God when we obey His words. We must set a good example for others and devote our lives to doing things that please God.",
            "prayer": "Help me, dear Lord, to constantly follow the pathway of honour. ",
            "action": null
        },
        "2025-11-06": {
            "date": "2025-11-06",
            "bibleText": [
                "Proverbs 30:18-23"
            ],
            "topic": "KNOWLEDGE LIMITATIONS",
            "content": "Man's wisdom and understanding have limitations. The writer of the text points out things that are yet to be fully known, such as how eagles fly, how snakes crawl on rocks, how ships sail, and the ways of a man and virgin. Despite this, God reveals what He wants us to know through His words. Everything is created for a purpose, and the major purpose is for God's pleasure. As a person, you are created to bring pleasure to God.",
            "prayer": "I thank you Lord for your interest in me. Help me to always bring pleasure to you, Amen! ",
            "action": null
        },
        "2025-11-07": {
            "date": "2025-11-07",
            "bibleText": [
                "Proverbs 30:24-33"
            ],
            "topic": "BE WISE",
            "content": "Everything we need to live a successful life is in the Bible. The text exposes us to basic realities that can help us improve our lives. We can learn from the ant about good preparation and saving for times of scarcity. From badgers, we learn to make strong and secured places to live in. Locusts teach us cooperation and order. From the spider, we learn to be fearless and bold. Lack of planning can lead to fear of retirement. Gambling is not a way to build one's fortune. We must learn from these creatures to be proactive and safety-conscious and to shun fear and inferiority complex.",
            "prayer": "Ask God to help you to be diligent in your business and to plan your life intentionally. ",
            "action": null
        },
        "2025-11-08": {
            "date": "2025-11-08",
            "bibleText": [
                "Proverbs 31:1-9"
            ],
            "topic": "GRADE YOUR SELF-WORTH",
            "content": "Our views about our lives and identities influence how we live. As a royal priesthood, your daily lifestyle must be Christ-like. Don't engage in anything that will destroy your relationship with God. The influence of wine and improper dealing with the opposite sex can make you lose your sense of direction. You have a future and a kingdom to protect, and you need to guard it jealously.",
            "prayer": "Merciful God, keep watch over me and save my life from wrong, Amen! ",
            "action": null
        },
        "2025-11-09": {
            "date": "2025-11-09",
            "bibleText": [
                "2 Corinthians 5:6-15"
            ],
            "topic": "A PURPOSE-DRIVEN LIFE",
            "content": "If we want to withstand the present challenges to our Christian faith, we need to deepen our personal relationship with God. The Christian faith demands all from a believer, and divided loyalty is not part of the system. Apostle Paul was not afraid to die because he was confident of where he would spend eternity. Every believer will be subjected to judgment and there will be rewards and consequences for our actions. We are no longer expected to live for ourselves but for Him who died and rose again. Do not gamble with your life and establish an intentional method of building your Christian faith.",
            "prayer": "Take my life and let it be, consecrated Lord to thee. ",
            "action": null
        },
        "2025-11-10": {
            "date": "2025-11-10",
            "bibleText": [
                "Proverbs 31:10-14"
            ],
            "topic": "DISTINGUISH YOURSELF!",
            "content": "The woman described in our reading is a picture of a woman with qualities every Christian woman should strive for. The virtuous wife is a blessing to her family, and the heart of her husband trusts her. She is concerned with making her home comfortable. A woman or man in a marriage who cannot be trusted takes some measures of blessings out of the home. In Proverbs 14:1, the wise woman builds her home, while the foolish pulls it down with her hands. It will be difficult for lasting peace to reign where trust is constantly betrayed. You need to put your house in order so that God can partner with your family to produce godly children.",
            "prayer": "Ask God to help you to build the family that attracts his interest. ",
            "action": null
        },
        "2025-11-11": {
            "date": "2025-11-11",
            "bibleText": [
                "Proverbs 31:15-19"
            ],
            "topic": "TAKE RESPONSIBILITY!",
            "content": "A person who needs peace must learn the secret of having peace. Our text contains basic lessons that can help families build healthy homes. The virtuous woman takes responsibility by rising early to prepare food for her household. She also makes investments in family interests and is a merchant with a commitment to family wellbeing. The change needed to make your home glorious is in your hands. Show commitment as the wife or husband that God has trusted to build a promising home. Give service and commendation where it is required.",
            "prayer": "Heavenly Father, may I never disappoint you in your great trust upon me in my family responsibilities, Amen! ",
            "action": null
        },
        "2025-11-12": {
            "date": "2025-11-12",
            "bibleText": [
                "Proverbs 31:20-24"
            ],
            "topic": "BE A CHANNEL OF BLESSING",
            "content": "A person who is blessed is required to be a blessing to others. The virtuous woman extends her hand to the poor and reaches out to the needy. Many people do not realize that part of the reason they are blessed is to be a blessing to others. In the case of the virtuous woman, her life brought honor to her husband. She is also a seamstress and a merchant. Be successful for the people around you and let your progress in life impact those who need help. Be resourceful and productive within your capacity.",
            "prayer": "Heavenly Father, help me to put my resources and gifts on things that will please you, Amen! ",
            "action": null
        },
        "2025-11-13": {
            "date": "2025-11-13",
            "bibleText": [
                "Proverbs 31:25-31"
            ],
            "topic": "PAY-BACK PERIOD",
            "content": "Good works have a reward, and bad works have consequences. The virtuous woman who served others is now being served and honored. Her children and husband rise up and call her blessed. Physical appearance never counted for her, but strength, efficiency, and ability did. Be a living example of good works and win the trust of people by rendering selfless service. Set good standards in every opportunity you have to serve.",
            "prayer": "Ask God to bless you and make you a channel of blessings to others. ",
            "action": null
        },
        "2025-11-14": {
            "date": "2025-11-14",
            "bibleText": [
                "Revelation 20:1-3"
            ],
            "topic": "YOU ARE VICTORIOUS",
            "content": "The devil is described as the dragon, the ancient serpent, the devil, and Satan. He is under the sovereign authority and control of Christ until God's purpose for you are fulfilled. Fear not, for it is your Father's good pleasure to give you the kingdom. You are safe under God's guidance, and the power of evil only operates by divine consent. Build your faith and trust in God.",
            "prayer": "Thank you Lord for my victory through the death and resurrection of Jesus Christ. ",
            "action": null
        },
        "2025-11-15": {
            "date": "2025-11-15",
            "bibleText": [
                "Revelation 20:4-6"
            ],
            "topic": "STRIVE TO ENTER",
            "content": "This text is an account of the reign of the saints while Satan is bound. Those who suffer with Christ will reign with him. This is called the First Resurrection, and the second death has no power over them. Those who have a part in the First Resurrection are blessed and holy. Outside of this, the rest of the dead will not live again until the thousand years are finished. You have the chance today to enroll yourself into the kingdom citizenship by accepting Jesus as the Lord of your life. You must not sacrifice eternity for any reason. The pathway might be narrow, but you must strive to enter.",
            "prayer": "Help me, dear Lord to live with eternity in view daily, Amen! ",
            "action": null
        },
        "2025-11-16": {
            "date": "2025-11-16",
            "bibleText": [
                "1 John 5:13-15"
            ],
            "topic": "ASSURANCE OF ETERNAL LIFE",
            "content": "John wrote the gospel so that Christians would believe in Jesus and have eternal life. You can know for certain that you have eternal life if you believe God's truth and in His Son, Jesus Christ. Eternal life is based on facts, not feelings or speculations. God's will is the key to answered prayers. When we pray, we should not demand what we want, but ask in accordance with what God wants for us. God knows what is good for us more than we do. If we align our prayers to God's will, He will hear us and give us definite answers.",
            "prayer": "Dear Lord, please let my will be lost in Your will. Speak to reassure me; speak and make me to listen; Amen. ",
            "action": null
        },
        "2025-11-17": {
            "date": "2025-11-17",
            "bibleText": [
                "Revelation 20:7-10"
            ],
            "topic": "NO MORE TROUBLE!",
            "content": "Satan's threats will one day cease forever, and peace will reign. After a thousand years of imprisonment, Satan will be released to gather an army against God's people, but fire will come down from heaven and consume the attacking army. Christians are assured that God's word must come to fulfillment. The devil will be thrown into a burning lake of fire to join the beast and false prophets, and they will be tormented forever. Satan's power and wickedness are not forever; he will be thrown into the lake of fire and will never be a threat again.",
            "prayer": "Dear Lord, help me to firmly believe in You, and be totally committed to You forever, Amen! ",
            "action": null
        },
        "2025-11-18": {
            "date": "2025-11-18",
            "bibleText": [
                "Revelation 20:11-15"
            ],
            "topic": "THE BOOK WILL BE OPENED!",
            "content": "The judgment of God will surely come to pass. The dead, great and small, will stand before the Great White Throne of God, and books will be opened, including the Book of Life. The Book of Life contains the names of all who committed their lives to Christ and put their trust in Him to save them. It also contains the records of every person's work, good or bad. Those whose names are not found in the Book of Life will be thrown into the lake of fire. Our works are evidence of our faith, salvation, and relationship with God. Commit yourself to doing good works, helping the poor and needy. Use your gifts and talents to serve the Lord and live a life of righteousness. Be careful about what you think, say, or do, knowing that one day the Book will be opened.",
            "prayer": "Dear Lord, take my life, and let it be consecrated to you. ",
            "action": null
        },
        "2025-11-19": {
            "date": "2025-11-19",
            "bibleText": [
                "Revelation 21:1-8"
            ],
            "topic": "NO MORE DEATH; NO MORE SORROW!",
            "content": "Our passage speaks of a new heaven and a new earth that the Lord will make when the old ones have passed away. God and His children, whose names are in the Book of Life, will be together to live there forever. If you persist to the end and unite with the Lord, God will wipe away tears from your eyes, and there will be no more death, sorrow, crying, or pain. Suffering, diseases, and poverty will be gone forever. You must rid yourself of all dirt, impurity, and uncleanness to unite with God. Those who fail to unite with the Lord will be thrown into hell fire where they will burn forever. If you haven't made peace with the Lord, do it quickly now to escape the wrath to come.",
            "prayer": "Father, give me the courage to say 'No' to sin, and 'Yes' to righteousness, Amen! ",
            "action": null
        },
        "2025-11-20": {
            "date": "2025-11-20",
            "bibleText": [
                "Revelation 21:9-21"
            ],
            "topic": "THE NEW JERUSALEM",
            "content": "The beauty of Harvard University Medical College cannot be compared to the beauty of heaven. Today's text is a beautiful description of the Holy City, the new Jerusalem, which is a place of perfect holiness and indescribable beauty. The foundation is garnished with all manner of precious stones. The New Jerusalem is a picture of God's future home for His people. Jesus assured us that there are many mansions in His Father's house and that He was going to prepare a place for us. Knowing that nothing defiled or unclean will enter the kingdom of God, we must get ourselves rid of such things that are capable of preventing us from entering and dwelling in this holy city.",
            "prayer": "Father, please help me to prepare to meet You in the new Jerusalem, Amen! ",
            "action": null
        },"2025-11-21": {
            "date": "2025-11-21",
            "bibleText": [
                "Revelation 21:22-27"
            ],
            "topic": "NO MORE POWER FAILURE",
            "content": "The holy Jerusalem will not need the sun, moon, stars or electricity because the glory of God will give light to the city, and Jesus Christ is its eternal light. Because there will always be light, darkness and sin will not exist. Not everyone will enter the New Jerusalem. Idolaters, adulterers, fornicators, liars, the wicked, envious, jealous, thieves, cowards, cheats, fraudsters, the occult, and those who do abominable things and reject Jesus will not be allowed in. Your marital status, wealth, education, political affiliation, gender, tribe, or race cannot grant you entry. The only qualification for entry is having your name written in the Lamb's Book of Life.",
            "prayer": "I want to live eternal life; God save my soul.",
            "action": null
        },
        "2025-11-22": {
            "date": "2025-11-22",
            "bibleText": [
                "Revelation 22:1-6"
            ],
            "topic": "NO MORE CURSE; NO MORE SICKNESS",
            "content": "When Adam and Eve sinned, God placed curses on them and drove them out of the Garden of Eden so they could not eat from the tree of life. In the New Jerusalem, the issue of sin has been dealt with through Jesus' blood, so there will be no sin. We will eat freely from the tree of life and live forever with God. In that city, there will be no sickness or curse, and nothing accursed will exist. Curses brought by sin and misbehavior will never exist again. There will be real joy and perfect freedom. These revelations are pure and true and will surely come to pass.",
            "prayer": "Dear Lord, please grant me the strength and grace to live for you, and to enter the New Jerusalem, Amen.",
            "action": null
        },
        "2025-11-23": {
            "date": "2025-11-23",
            "bibleText": [
                "Revelation 22:7-11"
            ],
            "topic": "ADVENT SUNDAY",
            "content": "Jesus is coming quickly, and those who keep the sayings of the prophecy are blessed. You can make yourself ready by keeping God's word. If you are living in sin, you will not desire the coming of the Lord. When John fell to worship an angel, the angel forbade him, stating he was a fellow servant and instructing John to worship God. The text warns against leaders who desire to be worshipped by others, as this is tampering with God's glory. We should point people to Jesus Christ, the Author and Finisher of our faith.",
            "prayer": "Almighty God, incline my heart to give You all the glory, and point men to you, Amen.",
            "action": null
        },
        "2025-11-24": {
            "date": "2025-11-24",
            "bibleText": [
                "Revelation 22:12-15"
            ],
            "topic": "WHAT TYPE OF REWARD?",
            "content": "The expression 'I am coming quickly' shows the nearness and certainty of Christ's return. He will surely come with his reward and will pay everyone according to their work. The reward will depend on the type of work done on earth. Good work, such as serving God sincerely, helping the poor and sick, will be rewarded, while bad work, like living in sin, fighting, cheating, and stealing, will not.",
            "prayer": "Dear Lord, help me to do good work as I wait for your coming, Amen!",
            "action": null
        },
        "2025-11-25": {
            "date": "2025-11-25",
            "bibleText": [
                "Revelation 22:16-21"
            ],
            "topic": "FREE DRINK FOR ALL",
            "content": "Jesus sent his angel to give the message to the churches. The Spirit and the Bride (Church) say, 'come'. Verse 17 extends an open invitation to anyone who is thirsty to drink freely from the water of life. Jesus is the one who gives this living water. All sinners are invited to come to Jesus for salvation and peace. A warning is given against deliberately distorting the word of God for selfish purposes, as serious punishment awaits such people.",
            "prayer": "Dear Jesus, I am thirsty; please give me salvation and fill me with righteousness and joy of salvation, Amen!",
            "action": null
        },
        "2025-11-26": {
            "date": "2025-11-26",
            "bibleText": [
                "1 John 1:1-10"
            ],
            "topic": "THE LIGHT, NOT DARKNESS!",
            "content": "God is light, and in him, there is no darkness at all. Light symbolizes what is good, pure, and holy, while darkness signifies evil and sin. If a person claims to be a Christian but lives in sin, they are a pretender. The evidence of fellowship with God is walking in the light. To stay refreshed as a Christian, you must have fellowship with one another, as the blood of Jesus cleanses from all sin and keeps us pure. You should resolve to regularly pray, study the bible, and attend church services.",
            "prayer": "Dear Father, help me to walk in the light and develop an intimate relationship with you.",
            "action": null
        },
        "2025-11-27": {
            "date": "2025-11-27",
            "bibleText": [
                "1 John 2:1-6"
            ],
            "topic": "ACID TEST!",
            "content": "John wrote this letter to discourage believers from living in sin because sin kills. We should not take our salvation for granted by living sinful lives. If we deliberately continue to sin after receiving knowledge of the truth, there is no longer a sacrifice to cover our sins. However, if we sin, we must immediately repent and confess to God, as Jesus Christ is the sacrifice that atones for our sins. The true evidence of Christianity is keeping God's commandments, which are summarized as love for God and for his people. If you love God, you will not intentionally sin against him.",
            "prayer": "Dear Lord, have mercy on me and incline my heart to keep your commandments, Amen!",
            "action": null
        },
        "2025-11-28": {
            "date": "2025-11-28",
            "bibleText": [
                "1 John 2:7-17"
            ],
            "topic": "ANCIENT AND MODERN",
            "content": "Love is both an old and new commandment. It is an old commandment from Leviticus 19:18 and a new commandment from Jesus in John 13:34, which is expressed through selfless giving, sacrifice, and doing good to your enemies. Love is the mark of Christianity, and by loving others, all men will know we are Jesus' disciples. Anyone who hates their brother or neighbor is not a Christian but is walking in darkness. We are advised not to love the world or the things in it, as the world will perish.",
            "prayer": "Heavenly Father, help me to love others through my actions. Help me to yield my members and desires to you, Amen!",
            "action": null
        },
        "2025-11-29": {
            "date": "2025-11-29",
            "bibleText": [
                "1 John 2:18-29"
            ],
            "topic": "THESE PEOPLE ARE LIARS!",
            "content": "The emergence of antichrists is a sign of the end times. These antichrists are liars who deny that Jesus is the Christ, deny his Lordship, and deny the Father and the Son. They deny the deity of Jesus Christ and that he came in a real body. Many cultists claim to be Christians but do not believe Jesus is divine. They may use adulterated bibles or perform rituals with the blood of animals. Anyone who rejects Jesus is an antichrist. You should watch out for and avoid people who perform rituals with incantations, animal blood, and candles, as they are not of God. If you receive or encourage their false teachings, you will partake in their wickedness.",
            "prayer": "Dear Lord, watch over me so that I do not go astray from the truth. Keep me shining in all I think, speak or do.",
            "action": null
        },
        "2025-11-30": {
            "date": "2025-11-30",
            "bibleText": [
                "Revelation 22:7-11"
            ],
            "topic": "ADVENT SUNDAY",
            "content": "Advent Sunday marks the start of the Advent season, a period of anticipation and preparation for the second coming of Jesus Christ. Jesus is coming quickly, and there is a blessing for those who will keep the prophecy of the Bible. Christ's second coming is a sure prophecy that will certainly come to pass. You can make yourself ready by keeping the faith of Jesus. When you begin to keep God's word, you will find yourself desiring the coming of the Lord.",
            "prayer": "Almighty God, incline my heart to keep Your word in preparation for Christ's second coming. Amen.",
            "action": null
        },"2025-12-01": {
            "date": "2025-12-01",
            "bibleText": [
                "John 1:34-41"
            ],
            "topic": "SPECIAL GRACE",
            "content": "Andrew was a fisherman, who hailed from Bethsaida in Galilee (John 1:44), but was called into special grace by Jesus Christ. He was one of the Twelve that became Apostles as chosen by the Lord; he is honoured with the title Protokletos (First-Called) in the church, because being initially a disciple of John the Baptist, he was one of the two that first recognized and followed Jesus as the Messiah, and introduced his brother Simon Peter to him (John 1:40, 41). Whenever you find Andrew in John's gospel, he is bringing somebody to Jesus: his brother, the lad with the loaves and fish (John 6:8-9), and the Greeks who wanted to see Jesus (John 12:20-21). No sermons from Andrew are recorded, but he certainly preached great sermons by his actions as a personal soul winner. As we celebrate him today, let us think of how we can become closer companions of Jesus through our daily and intentional study of the word, and prayers. These will empower us to bring more people to Christ by our personal touch in words and actions, and the Kingdom of God will be enlarged by our efforts.",
            "prayer": "Lord, endow me with special grace as I draw closer to You day by day. Amen! ",
            "action": null
        },
        "2025-12-02": {
            "date": "2025-12-02",
            "bibleText": [
                "1 John 3:1-3"
            ],
            "topic": "HOPE THAT PROVOKES PURITY",
            "content": "Many persons have often wondered the justification for suicide. A particular service provider has \"Life is Beautiful\" as its advertisement slogan. The question always is: Why will someone want to kill him/herself in the midst of this beauty?  My response has always been that when hope is lost, anything negative is possible. No matter how difficult life may be, a man of hope will get going. Our passage today speaks of the manner of love that God has for his children, and the expectation of being like Christ when we shall behold him at the end of time. The idea of becoming like Christ fascinated John so much that he was ready to pay any price to actualise it. This was the ground of his hope; it was not temporal but completely eternal. In the hope of being like Christ, he was willing to pursue the purity required. The evidence of our sincere desire to becoming like Christ is seen in our commitment to be pure. Until we begin to pursue purity, our profession of the Second Coming, the Millennial Reign and the Reunion with Christ is nothing but pretence.",
            "prayer": "Lord, purify me until I become like You, Amen! ",
            "action": null
        },
        "2025-12-03": {
            "date": "2025-12-03",
            "bibleText": [
                "1 John 3:4-12"
            ],
            "topic": "THE ANTIDOTE (REMEDY) TO SIN",
            "content": "In recent times, the doctrine of \"Once Saved, Always Saved, often referred to as 'OSAS' gospel, continues to downplay the grievousness of sin; with the wrong belief that one cannot lose his/her salvation. However, we must remember that God cannot behold iniquity and that no sinner can inherit the kingdom of God. Therefore the issue of sin has to be dealt with. From John's account in this passage, sin can NOT accompany the spiritual birth. Sin cannot co-exist with a believer who is born of the spirit. John stresses two important issues, which I can term the \"drug and vaccination\" against sin. The vaccination is the issue of the spiritual birth which deposits a part of God - the seed of God - in us. The drug is the fact that we remain in Christ. This is the ANTIDOTE to sin. It makes it impossible for us to sin. We cannot claim righteousness outside of Christ.",
            "prayer": "Dear Lord, please help me to remain in You so that I do not sin against You. ",
            "action": null
        },
        "2025-12-04": {
            "date": "2025-12-04",
            "bibleText": [
                "1 John 3:13-24"
            ],
            "topic": "THE FORCE OF GOD'S LOVE",
            "content": "This passage brings another perspective into our understanding of 'love.'  The apostle presented 'love' as a transporter which knows no barrier. It breaks barriers and demarcations. The confirmation of our destination is shown by the love we possess. Love is a spiritual transmission-agent that changes a man's location; from death to life. At the exit gate of death, love is the ticket required for passage. Love is that thing that empties a man (v.17), even of his blood, for the sake of his neighbour. The language of love is sacrifice; it is expressed not in word but in deed. There is no price it cannot pay; there is no gate it cannot open; there is no weakness it cannot tolerate; there is no offence it cannot forgive and there is no evil it cannot overcome. A demonstration of love is an assurance that we are living in the truth of God's word and it is the insurance of our hearts in the presence of God. Beloved, what sacrifice have you made for God and for man to reflect the kind of force which can only be seen in God's love? ",
            "prayer": "Lord, please give me true love for divinity that can be reflected in humanity.",
            "action": null
        },
        "2025-12-05": {
            "date": "2025-12-05",
            "bibleText": [
                "1 John 4:1-6"
            ],
            "topic": "THE CENTRALITY OF THE HUMANITY OF CHRIST",
            "content": "The humanity of Christ speaks about the complete human nature that Christ assumed at his incarnation. It explains the adequacy of his representation as the holy contact by which our humanity meets God. A part of the Nicene Creed is dedicated to this truth. It states that \"he became incarnate from the Virgin Mary, and was made man. For our sake he was crucified under Pontius Pilate; he suffered death and was buried.\"  The acceptance of his substitutionary death - taking the place of man - is built on the fact that He was FULLY man. So, the teaching of Docetism (denying the reality of Christ's full humanity), goes to the root of our salvation. This truth of Christ's full humanity also brings out the humiliation he undertook for our redemption; that God was made man. It also made Christ a PERFECT EXAMPLE as one who has shared a common experience and has become touched by the feelings of our infirmities. The implication of these is that on the last day; no man shall be with any excuse of not living the victorious Christian life. It is possible and it has been proven.",
            "prayer": "Lord, You took on my form to save me, help me to take your form to be eternally saved.",
            "action": null
        },
        "2025-12-06": {
            "date": "2025-12-06",
            "bibleText": [
                "1 John 4:7-21"
            ],
            "topic": "LOVE EXPLAINED AND EXEMPLIFIED",
            "content": "The most profound definition of love is found here. It says GOD IS LOVE. There are many virtues we talk about but none equals God, save love. No wonder Paul, in writing to the Galatians, says the fruit of the Spirit is love. Therefore, no man can be termed godly or spiritual who does not possess love. John said the gift of God's only begotten Son, Jesus, as an appeasement, was provoked by the love that God has for us. The example here is that God gave his best to secure our redemption. It is expected that we give our best to ensure that everyone around us is reconciled to his/her Maker. While it is lawful to give gifts to men and meet their material needs; we must say that the authenticity and power of our love is demonstrated in our investments to have others saved from darkness to light.",
            "prayer": "Lord, refine me by your love and cause me to be defined by it, Amen! ",
            "action": null
        },
        "2025-12-07": {
            "date": "2025-12-07",
            "bibleText": [
                "Isaiah 9:1-7"
            ],
            "topic": "DARKNESS IN THE MIDST OF LIGHT",
            "content": "Advent focuses on John the Baptist, the Gentiles being included in God's family, Christ's coming in judgment and peace, and the church's hopeful expectation of the completion of his promises. Today's passage is one of the Messianic prophecies of Isaiah. It partly says: \"The people who dwelt in darkness have seen a great light.\"  Jesus' birth brought the fulfillment of this prophecy. John later said of Him: \"... in Him was life and the life was the light of men\" (John 1:4). Before the creation of the 1st Adam, the world was full of darkness; without form and void. And God said 'let there be light and there was light.'  Similarly, before the coming of the 2nd Adam (the Great Light), the earth was filled with spiritual darkness. However, though all who sat in darkness saw the great light, there was no guaranty that they all left darkness. Though darkness did not comprehend the light, the light did not \"kill\" darkness. Darkness left the public space where the light appeared and entered into the private residence prepared by men who loved darkness. Beloved, darkness has lost its legal authority over you by Christ's birth and death. As we look forward to another Christmas, let us ask the Lord to shed His light in every darkened spot in our lives.",
            "prayer": "Lord, may I experience You, the Great Light, to the fullest and in its fullness, Amen! ",
            "action": null
        },
        "2025-12-08": {
            "date": "2025-12-08",
            "bibleText": [
                "1 John 5:1-13"
            ],
            "topic": "LOVE AND OBEDIENCE",
            "content": "One can secure obedience by the use of force or threat of punishment. However, true obedience comes from conviction or faith. In this passage, we see that love and obedience are more like Siemen twins that cannot be separated. No man can say he has love for God when he disobeys God's instructions. There is nothing we cannot give up when love is involved. When we love God, our lusts and evil pleasures will be easy to abandon. John gave us an equation that can help us examine ourselves daily. He says if we love God, we must love God's children. One way to know that we have love is when we obey God's commandments. John also said that it is not possible to love God if we are not born of God. He added that if we are not born of God, we cannot overcome the world . and we cannot be born of God until we first believe that Jesus is the Son of God. We must believe in His immaculate conception and in His deity.",
            "prayer": "Lord, help me to become rooted in my faith and love for You.",
            "action": null
        },
        "2025-12-09": {
            "date": "2025-12-09",
            "bibleText": [
                "1 John 5:14-21"
            ],
            "topic": "DO NOT BE DECEIVED, KEEP YOURSELF",
            "content": "This exhortation has become necessary amidst the lust and loose living which have crept into the congregation of the saints. In the debate of whether a man can lose his salvation or not, this message becomes very critical. In verse 18 Paul says: We know that whoever is born of God does not sin; but he who has been born of God keeps himself, and the wicked one does not touch him. This verse sums up the 3-way relationship on the matter of our salvation. When we become born of God and abide in Christ, it becomes impossible to sin. Our responsibility is to ensure we keep ourselves in Christ, otherwise, the wicked one will touch us; and when he does, we will sin. John further admonishes: We know that we are of God but we have a duty to keep ourselves; lest we lose our identity and thereby lose our security.",
            "prayer": "Lord, please keep me secured in You; may I not stray away from Your presence.",
            "action": null
        },
        "2025-12-10": {
            "date": "2025-12-10",
            "bibleText": [
                "2 John 1:1-6"
            ],
            "topic": "THIS MATTER OF LOVE",
            "content": "Over the last couple of days, our meditations have in one way or the other, been related to love. There is something that God must be telling us. We know that if we take love away from Christianity, what may be left would be Judaism. Love is the bedrock of Christianity. John was never able to leave off the message of love. Even in his 2nd epistle, he pleaded in verse 5: \"And now I plead with you, lady, not as though I wrote a new commandment to you, but that which we have had from the beginning: that we love one another.\"  There is nothing more and there is nothing new we can say until we all come to understand, appreciate and imbibe the spirit of love which is the trademark of our Christian faith. If we say we are Christians, if we say we are born of God, if we desire to overcome the world, then we must show forth and share love to the brethren. Until we all become an embodiment of love, the church will be far from perfection.",
            "prayer": "Dear Lord, may nothing else show forth from my life except you love, Amen! ",
            "action": null
        },
        "2025-12-11": {
            "date": "2025-12-11",
            "bibleText": [
                "2 John 1:7-13"
            ],
            "topic": "LOOK TO YOURSELF THAT WE LOSE NOT",
            "content": "This is a note of caution from the Apostle on the back of the activities of false teachers and deceivers, amongst God's people. Those false teachers denied the humanity (the incarnation) of Christ. And for us today, they are those who teach the concept of sexual liberality, irresponsible Christianity, moral lousiness, feminism, etc. Some say that all you need to do is to confess Jesus Christ as your Lord and Saviour; and regardless of what you do afterwards, you will be fine. In order for us not to lose and be lost, John says we should look to ourselves. He said we should beware of being like them, thereby losing the prize that we have been working so hard to get. It is the reason Paul said to the Philippians (2:12-13): Work out our salvation with fear and trembling. He said to the Corinthians: Let him who thinks he stands take heed lest he fall (1Cor. 10:12). We should not become so unguarded to the point of missing our bearing.",
            "prayer": "Lord, help me not to lose sight of the track you are leading me on, Amen! ",
            "action": null
        },
        "2025-12-12": {
            "date": "2025-12-12",
            "bibleText": [
                "3 John 1:1-8"
            ],
            "topic": "GAIUS, A BROTHER INDEED!",
            "content": "Gaius was probably a companion of John and a faithful member of the church. He was prominent enough to have been the addressee of this 3rd epistle. He was committed to the work of God and perhaps seen as the face of the church. John praised him for showing unselfish devotion to Christ, by providing accommodations for God's travelling servants. Gaius expended his resources to care for God's servants. Little wonder, the manner of John's prayer for him. Gaius, no doubt, was spiritually healthy. The NLT says: Dear friend, I am praying that all is well with you and that your body is as healthy as I KNOW your soul is. Verse 3 sums it up: \"Some of the brothers travelling by have made me very happy by telling me that your life stays clean and true; and that you are living by the standards of the gospel. Beloved, what is your testimony before the brethren? Can it provoke further prayers on your behalf; just like John did for Gaius when he said: \"I wish that thou mayest prosper in all things and be in health...\" ",
            "prayer": "Lord, may my testimony be soul-lifting and life-changing.",
            "action": null
        },
        "2025-12-13": {
            "date": "2025-12-13",
            "bibleText": [
                "3 John 1:9-14"
            ],
            "topic": "DIOTREPHES AND DEMETRIUS",
            "content": "These two characters were obviously notable personalities in that local assembly, similar to those we can refer to as prominent members of the Parish Church Council or Diocesan Board. Diotrephes was a spoiler who used malicious words to instigate the brethren to reject God's servants (the missionaries). He was so terrible that he would launch persecution against those who found reasons to accommodate the brethren. He denied the entire church of her role of hospitality. On the contrary, John spoke about Demetrius who was of a sweet spirit, and had a good testimony. He was not lured or influenced by the activities of Diotrephes but made himself accountable to the truth of God's word. In all, John had an admonition for Gaius specifically and by application, for the Church in general. He said: Dear friend, don't let this bad example influence you. Follow only what is good.",
            "prayer": "Lord, make me a person of positive influence and increase my sphere of impact.",
            "action": null
        },
        "2025-12-14": {
            "date": "2025-12-14",
            "bibleText": [
                "Hebrews 1:1-12"
            ],
            "topic": "THE SON OF GOD",
            "content": "Advent III is meant to remind us of the joy that the world experienced at the birth of Jesus, as well as the joy that the faithful have reached the midpoint of Advent. In this passage, the writer talks about the peculiar role of Christ in the present dispensation, as God's channel of communication, his superiority over the angels and men; and the honour that the Father bestowed on Him. He reveals to us the greatest title that any man can receive to be called \"Son of God.\"  Today, we see a contrast by the indiscriminate chasing of titles and desperate search for recognition by believers, especially ministers. Today, some ministers prefer to replace the title 'Pastor' with 'Dr.' because they prefer to be known as those who have acquired great knowledge rather than those who have been called of God by a divine revelation. The body of Christ has invented many titles; some are even fearful and blasphemous!  Beloved, we need to pause, ponder and shift from the values built around the worldly system, to a kingdom mindset where sonship becomes the focus; ensuring that our relationship with the Father is intact.",
            "prayer": "Lord, help me to constantly secure and value divine recognition, Amen! ",
            "action": null
        },
        "2025-12-15": {
            "date": "2025-12-15",
            "bibleText": [
                "Luke 1:26-33"
            ],
            "topic": "DIVINE VISITATION AND THE MATTER OF LOCATION",
            "content": "The story here is commonly referred to as the Annunciation of Jesus. But our focus is the remoteness of the location of this visit. It was Galilee, a place held in contempt because it was over-run with Gentiles. And specifically, to the small village of Nazareth, which was a hotbed of corruption. Remember the exclamation of Nathaniel when he heard about the Lord: \"Can anything good come out of Nazareth?\"  Nathaniel was living in a neighbouring city, so he knew so much about the corruption of Nazareth and the fact that nothing good was expected from it. Yet to this corrupt town, went Gabriel, bearing the world's greatest announcement. Rather than being influenced by the city, Mary radically altered the historical perspective of the place and giving birth to Jesus here permanently changed the outlook of the city, in time and in eternity. Today, we call Him Jesus of Nazareth. This is to encourage us that God's visitation is not determined by location. We do not need to 'japa' before we can receive divine visitation.",
            "prayer": "Lord, position me for your recognition and visitation.",
            "action": null
        },
        "2025-12-16": {
            "date": "2025-12-16",
            "bibleText": [
                "Luke 1:34-38"
            ],
            "topic": "THE GOD OF IMPOSSIBLE THINGS",
            "content": "There are several seemingly impossible stories in the Bible. We have the stories of a flood that covered the earth, a sea divided so people can walk through, the sun that keeps shining until a battle is won, and a man who survives three days in the belly of a fish. Similarly, in today's passage we read about the impossible story of God's angel who tells Mary that she would conceive in her womb through the direct operation of the Holy Spirit, who would overshadow her, notwithstanding that she was a virgin who had never had a sexual relationship with a man. However, Mary received the message with faith (v.38b). Indeed, God is the Creator of all things and can alter what He has created. He can break into natural laws and cause the supernatural to happen. Like Mary, we need faith that opens up new dimensions, making us understand that what we see is not all there is, and that with God all things are possible. By faith, we learn to recognise and appreciate the impossible things God does for us each day such as forgiveness, healing, provision, etc. The more we see the impossible acts of God with the eyes of faith, the stronger our faith in him will become.",
            "prayer": "Father, grant me the eyes of faith to see You as the God of impossible things, Amen.",
            "action": null
        },
        "2025-12-17": {
            "date": "2025-12-17",
            "bibleText": [
                "Luke 1:39-56"
            ],
            "topic": "CHRISTIAN FELLOWSHIP",
            "content": "Christian fellowship thrives on two essential pillars: a deep personal communion with God and a meaningful and loving relationship with fellow believers. These two arms of fellowship - vertical with the Divine and horizontal with humanity  together form the foundation of a vibrant, holistic Christian community. Today's passage focuses on the blessedness of believers fellowshipping with one another. And let us consider how to stir up one another to love and good works, not neglecting to meet together as it is the habit of some, but encouraging one another... (Hebrew 10: 24-25). Consequent upon Mary's angelic visitation as we have read in previous days (v 28-37), she thought it wise to visit her cousin Elizabeth to felicitate with her and possibly to render any needed assistance during her prenatal days (remember Elizabeth was pregnant at old age) (v7,24-6,39 & 56). However, a causal Christian fellowship soon gave birth to another dimension of spiritual edification and empowerment (v41-55). Friend, do you think Mary had it in her mind that her visit to her cousin was going further establish what Angel Gabriel said to her prior to the visit?  No, she simply went to fellowship!  Our horizontal fellowship with one another is as important as our vertical relationship with God. There are many benefits we stand to derive from it ; ranging from physical (services, encouragement, financial empowerment and bailouts, conflict resolution, sharing burden, correction and advise, etc.) to spiritual (intercession, Bible study, words of wisdom, etc.).",
            "prayer": null,
            "action": "Make up your mind today to commit yourself more deeply into fellowshipping with other believers."
        },
        "2025-12-18": {
            "date": "2025-12-18",
            "bibleText": [
                "Luke 2:1-7"
            ],
            "topic": "GOD'S PURPOSE AT WORK",
            "content": "In today's text, we see God working His purpose out following Caesar Augustus's Decree that a census be conducted to register the people for tax purposes. Interestingly, the census went out in God's perfect timing and according to God's perfect plan to bring his Son into the world. Is it a coincidence that Jesus was born in the very town prophesied for his birth (Micah 5:2), even though his parents did not live there?  God was just working out His specific purpose through Joseph and Mary. Mary's song of joy reveals how well she knew God, for her thoughts were filled with God's words from the Old Testament (Luke 1:46-55). Similarly, Joseph is said to be a just (righteous) man (Matt. 1:19). So, Joseph and Mary knew God intimately, hence He ordered their steps (cf. Psalm 37:23), ending in them becoming the earthly parents of Jesus. God has a general purpose and a specific purpose for everyone. We exercise God's general purpose when we let the love of Jesus shine through us to make an impact on others - using effectively the spiritual gifts He has given us to make a positive contribution wherever we live. The more we fulfil our general purpose, the clearer our specific purpose will become, just as it happened with Joseph and Mary.",
            "prayer": "Father, help me live for you daily so I can fulfil my specific assignments for You, Amen! ",
            "action": null
        },
        "2025-12-19": {
            "date": "2025-12-19",
            "bibleText": [
                "Luke 2:8-14"
            ],
            "topic": "SHARE THE GOOD NEWS (I)",
            "content": "Have you ever been sent to deliver a message that would gladden the heart of someone?  If yes, how did you feel after sharing the message?  This was the situation with the shepherds while watching over their flock by night, when an angel appeared to them to bring them good tidings (news) of great joy which would be to all people. The good news, it was announced, would bring great joy to all people. And what is the good news itself? \"For there is born to you this day in the city of David a Saviour, who is Christ the Lord\" (v.11). This is the message that is shared at Christmas. As the angel announced this good news to the shepherds, an innumerable company of angels joined in announcing this good news as they sing praises to God for His good-will to men, manifested in his sending of the Messiah (vv. 13,14). Since it is a matter of great joy to all people, the message of Christmas is not to be kept secret. The angel proclaimed it to the shepherds, the choir of angels sang it, so too you should proclaim it and sing it. Tell it to whoever you please. Proclaim it on the mountaintops; proclaim it in the valleys that Jesus Christ is born.",
            "prayer": "Lord, may I not relent in sharing the good news this Christmas and beyond, Amen.",
            "action": null
        },
        "2025-12-20": {
            "date": "2025-12-20",
            "bibleText": [
                "Luke 2:15-20"
            ],
            "topic": "SHARE THE GOOD NEWS (II)",
            "content": "The shepherds would stop at nothing until they confirmed the good news of the birth of Jesus which the Lord had made known to them. They had to journey in haste to Bethlehem where the baby was. Having found Mary and Joseph, and the Babe lying in a manger as revealed to them by the angel, the Bible says they spread the good news concerning the Baby Jesus (v.17). Notice three things that happened following the proclamation of the shepherds concerning the new born Baby. First, all those who heard the news marveledthey were amazed at what the shepherds told them (v.18). The Amplified Bible says those who heard it were astounded (shocked/greatly surprised) and wondered.  Yes, the Christmas story is no ordinary story! Share it to 'shock' or 'greatly surprise' someone such that it may lead that someone to Christ. Second, Mary pondered in her heart the visit of the shepherds (v.19). The message of Christmas can touch the heart to transform lives, so share it to transform the life of someone. Third, the shepherds returned glorifying and praising God for what they had heard and seen (v.20). Remember, the message of Christmas comes with 'great joy' (v.10). Share the good news with someone today so as to bring them great joy! ",
            "prayer": "Father, as I share the message of Christmas, may somebody be won for Christ, Amen! ",
            "action": null
        },
        "2025-12-21": {
            "date": "2025-12-21",
            "bibleText": [
                "Luke 2:21-24"
            ],
            "topic": "BE LAW ABIDING",
            "content": "The Scripture enjoins Christians to be subject to governing authorities because the authorities that exist are established by God (Rom. 13:1 cf Titus 3:1; 1 Pet. 2:13). Jesus' parents were law-abiding Jews. They showed up at the temple to perform sacrifices associated with a wife's purification after birth, in line with the law that a son be circumcised on the eighth day (Luke 2:21 cf Lev. 12:2-4, 6). The Boy, Jesus, was therefore presented in the temple. This was done with an eye to the law, and at the time appointed by the law, when He was forty days old, when the days of the mother's purification were accomplished (Luke 2:22-23 cf Ex. 13:2,12). The mother also brought her offering \"according to what is said in the law of the Lord\" (Luke 2:24 cfExod. 13:2,12). Our God commands us to be law-abiding because all authorities that exist are appointed by Him. When we are obedient to the authorities, it is actually God we are obeying. However, we may choose to disobey man when what we are told to do does not glorify God (Acts 5:29). The Scriptures admonish us in particular to obey those who rule over us, and be submissive, because they watch out for our souls, as those who must give account; and when we obey them, it makes their work a joy and not a burden (cf Heb. 13:17). From today, make the work of those who lead you a joyful one by obeying them and you will be blessed for it.",
            "prayer": "Father, as I obey constituted authorities, may Your glory be shed on my way, Amen! ",
            "action": null
        },
        "2025-12-22": {
            "date": "2025-12-22",
            "bibleText": [
                "Luke 2:25-35"
            ],
            "topic": "JUST BEFORE YOUR LAST BREATH",
            "content": "We read in Hebrews 9:27 thus, And as it is appointed for men to die once, but after this the judgment.  Until Christ's Second Coming, each one of us will continue to keep an appointment with death, that is, breathe our last breath. This was the experience of Simeon, a devout Jew who was looking for the 'consolation' or salvation (Luke 2:30) of Israel. And in verse 26 We read that the Holy Spirit revealed to Simeon that he would not see death until he had seen the Lord's Christ. True to this revelation, Simeon saw the infant Jesus as He was brought to the temple by Joseph and Mary to dedicate the Child (the Nunc Dimittis) and prophesied. Simeon could now die (breathe his last breath) in peace after seeing Jesus, who is the salvation of Israel (v.29). Beloved, like Simeon, we must resolve to have a personal encounter with Jesus before we take our last breath and depart this world. Not to do so is to miss the inheritance that can never perish, spoil or fade  an inheritance kept in heaven for Christians (1 Pet. 1:4). Be reminded that there is no repentance in the grave. Now is the day of salvation; tomorrow may be too late.",
            "prayer": "Father, help me work out my salvation with fear and trembling before I breathe my last.",
            "action": null
        },
        "2025-12-23": {
            "date": "2025-12-23",
            "bibleText": [
                "Luke 2:36-40"
            ],
            "topic": "SERVING THE LORD UNTO OLD AGE",
            "content": "We all pray to live long on earth. The Bible promises to grant the enjoyment of long life to those who honour their parents (Deut. 5:16 cf Eph. 6:2-3). The Lord also promises his continued love and never-ceasing care for the elderly when He says, Even to your old age, I am He, And even to gray hairs I will carry you! I have made, and I will bear; Even I will carry, and will deliver you (Isa. 46:4). We can see Anna hold on to this promise of being sustained by the Lord at old age, to serve Him. The grace of God was truly upon her, true to her name Anna which means 'grace.'  Her age has been variously reckoned from 84 to 105 years since she had been married for seven years, following which she had been a widow, either for 84 years or until her eighty-fourth year. Notice that even at very old age, she did not depart from the temple, but served God with fastings and prayers night and day (v.37). Let us pray the Father to bestow this same grace that was upon Anna on the aged ones today. It is not good that at retirement age, we become unproductive, especially in God's service. Grace makes the difference at old age, for we can still stay fresh and green.",
            "prayer": "Father, grant that the aged ones ...will still bear fruit in old age...stay fresh and green (Psa. 92:14), in Jesus' name, Amen! ",
            "action": null
        },"2025-12-24": {
            "date": "2025-12-24",
            "season": "Christmas Eve",
            "bibleText": [
                "John 3:15-17"
            ],
            "topic": "WHAT HE DIDN'T COME FOR",
            "content": "Today is Christmas Eve and as from 12 midnight, we shall be wishing our loved ones 'Merry Christmas.' At Christmas, we often talk about why Jesus came into the world. But we can also talk about what God did not send His Son into the world to do: \"For God did not send his Son into the world to condemn the world, but to save the world through him\" (v.17). Yes, God did not send Jesus to condemn the world. Isn't that good news? Of course! This verse underlines for those who have doubts about the Christian faith who God really is. Many assume that God is always keen to 'condemn', but John is clear that the opposite is true. We are confronted with the challenge of our sinful state which requires judgement and condemnation. But we see in the whole of Scripture, God's redeeming plan which centres on the coming of Jesus. So, every Christian has the task of helping those who are confused about who God is and what He is like. Some think their sins are too grievous to be forgiven; that God had already condemned them. However, the God who sent His Son not to condemn the world but to save it, is the God of love, goodness and grace, and He desires to be our friend and lead us in abundant living. Jesus did not come to condemn the world - here is the message to share at Christmas.",
            "prayer": "Father, thank You for Your good purposes for me and all humanity, Amen! ",
            "action": null
        },
        "2025-12-25": {
            "date": "2025-12-25",
            "season": "Christmas Day",
            "bibleText": [
                "John 1:1-14"
            ],
            "topic": "THE WORD HAS BECOME FLESH",
            "content": "We come once again to Christmas, and it's time to hear the truth of our faith. The Babe wrapped in swaddling clothes and lying in a manger is Almighty God who is born to struggle like a man with this world, and as He departs from it, He will carry with him forever, the marks of his humiliation. No other god can speak to our condition because no other god ever became flesh! This Jesus who is God became flesh and dwelt among men. It is remarkable that God himself would be this perfect sin-saving, peace-giving, light-shining leader, who would live among us and die to unite us fully with God. We gasp at such a revelation, but it's true. The Word has become flesh. And that is the meaning of Christmas. Can you see why we should sing our favourite carol today from the rooftops, as loudly as we dare, celebrating God's great love in sending Jesus?  Let the Christmas Word who has become flesh be our perfect teacher so that in his life, we may see how God thinks and how we should think. Let Him be our perfect example as a model of what we are to become, to show us how to live and give us the power to live that way ; and let him be our perfect sacrifice - He who came as a sacrifice for all sins, that his death may satisfy God's requirements for the removal of our sins.",
            "prayer": "Lord Jesus, thank You for coming to us, living among us, and being our Saviour, Amen! ",
            "action": null
        },
        "2025-12-26": {
            "date": "2025-12-26",
            "season": "St Stephen's Day",
            "bibleText": [
                "Acts 7:54-60"
            ],
            "topic": "LIKE CHRIST LIKE STEPHEN",
            "content": "Saint Stephen is the first Christian martyr, according to the New Testament (see Acts 6 & 7). He is recorded as standing out from the others in faith, grace, spiritual power, and wisdom (Acts 6:5, 8, 10). Stephen truly knew Christ and the power of his resurrection and participated in His sufferings, becoming like him in his death. Just as false accusations were brought against Jesus (Matt. 26:59-61; Mark 14:57-59), leading to his crucifixion, so too Stephen was falsely accused (Acts 6:11,13,14), and subsequently executed (Acts 7:58). Stephen prayed (Acts 7:60) as Jesus had done (Luke 23:34) for his persecutors to be forgiven. He also committed his soul into Christ's keeping (Acts 7:59) as Jesus committed his spirit into the Father's hands (cf. Luke 23:46). He met his end courageously, as Jesus, his Master, did. Stephen imitated Christ to the letter, hence we can say of him, \"Like Christ, like Stephen.\"  Every Christian has been called to imitate Christ. After all, every Christian is a follower of Christ (Acts 11:26; 26:28; 1 Pet. 4:16). As we continue in the celebration of Christmas, put your name in the blank space provided here and see whether it fits in like that of Stephen: \"Like Christ like ....\" If it fits, praise God; and if not, pray to God passionately to be like Christ.",
            "prayer": "Father, I receive the power to be like Christ, Amen! ",
            "action": null
        },
        "2025-12-27": {
            "date": "2025-12-27",
            "season": "St John the Apostle's Day",
            "bibleText": [
                "John 21:19-24"
            ],
            "topic": "THE BELOVED DISCIPLE",
            "content": "Today is set aside to commemorate St. John, the Evangelist and Apostle. John was among the first disciples Jesus called (Matt. 4:21-22; Mark 1:19-20). John's intimacy with Jesus earned him the expression, 'the disciple Jesus loved', such that he could lean on Jesus' breast at supper (John 21:20). The results of John's intimacy with Jesus include: (1) Being the first of the apostles to believe in the resurrection on the basis of what he saw in the empty tomb (John 20:8). (2) It was his insight that detected the risen Lord as the one responsible for the great catch of fish (John 21:7). (3) In Galatians 2:9, he is counted as a pillar of the Jerusalem church, along with Peter and James. (4) He wrote the Gospel according to St John (v.24), the three epistles of John, and the book of Revelations, all of which testify about Jesus. John's intimacy with Jesus as the beloved disciple helped him learn to understand the very heart of Jesus and do exploits for the kingdom. We can also become \"beloved disciples\" when we commune with Jesus through constant prayer, regular study of the Scriptures and fellowship with fellow believers. As we do so, the eyes of our hearts will be enlightened in order that we may know the hope to which the Lord has called us, the riches of his glorious inheritance in his holy people (Eph. 1:18).",
            "prayer": "Lord Jesus, grant unto me all it takes to be the disciple You love, Amen! ",
            "action": null
        },
        "2025-12-28": {
            "date": "2025-12-28",
            "season": "Christmas I",
            "bibleText": [
                "1 Peter 4:12-16"
            ],
            "topic": "EXPECT AND PREPARE FOR AFFLICTION",
            "content": "There is the popular saying that \"When you fail to plan, you plan to fail.\"  When we read through the Book of Acts, we will discover that trials were common to first-century Christians. Some were mobbed, imprisoned, and even killed as a result of their faith. Knowing that persecution will certainly arise against Christians, Jesus had to prepare the minds of his followers in this regard, promising to send his Spirit to strengthen them when it happens (Luke 12:11-12). Here, Peter writes to encourage Christians who are suffering, not because of any wrongdoing of theirs, but as a result of attack on their faith, not to see suffering as \"some strange thing\" (v.12). This is not to say Christians should pray to encounter suffering. Far from it! Rather, they should expect it and prepare for it. Honestly, God's plan for your life may include pain and hardship. So, when trouble comes, don't be surprised but see it as a test of faith. James enjoins us to consider it \"pure joy\" when we face trials of many kinds (James 1:2). A sure way to prove that you are prepared when suffering comes, is not to ask God \"why me?\", but to ask Him to show you \"how\" you can use the suffering to glorify Him.",
            "prayer": "Father, may every suffering I encounter, make my faith in you more mature, Amen! ",
            "action": null
        },
        "2025-12-29": {
            "date": "2025-12-29",
            "season": "The Holy Innocents' Day (Transferred)",
            "bibleText": [
                "Matthew 2:13-18"
            ],
            "topic": "BE COMFORTED!",
            "content": "The slaughter of all male children two years old and under in Bethlehem and its environs by Herod the Great, in his effort to destroy the Christ Child (Matt. 2:16), is often commemorated as The Holy Innocents' Day. The children are innocent because they had done no wrong to warrant their deaths. In the midst of the rejoicing that a Saviour had been born (Luke 2:10-11), Matthew pauses to mark the heartbroken grief of the mothers who had lost their children as a result of Herod's jealousy (Matt. 2:13-18). Though Baby Jesus escaped the killings, which is good, the other babies paid the price of an evil man in a position of power. Just as it was a time of rejoicing when Jesus was born as well as a period of mourning because of the innocent young souls murdered, so too we have mixed feelings when we celebrate Christmas today. While some have joyful time with church and family, others have painful times full of loneliness and sorrow. When we face great pain, we need others to lament with us and mark those anniversaries. As the jollity of Christmas continues, let's pause like Matthew to remember those who face great pain and loss, whether that loss was yesterday or decades ago which becomes fresh in their memories every Christmas because it occurred during this season in time past. If that's you, know that God knows your grief; be comforted.",
            "prayer": "Pray with Jeremiah 31:13b: \"For I will turn their mourning to joy, Will comfort them, And make them rejoice rather than sorrow.\" ",
            "action": null
        },
        "2025-12-30": {
            "date": "2025-12-30",
            "season": null,
            "bibleText": [
                "John 1:14-18"
            ],
            "topic": "FULL OF GRACE AND TRUTH",
            "content": "Did you take notice of the expression, \"full of grace and truth\"? (v.14) . It tells us that there are no contradictions in Christ's character such grace and ungrace, truth and untruth. In Christ, there is grace and only grace; truth and only truth!  Whatever Jesus taught, that He also practised, for He never made any moral statement that He did not demonstrate in his life. Yes, Jesus is a perfect unified person!  Beloved, we all have flawed characters. Still, some of us are more flawed than others, for we have grace laced with ungrace, and truth laced with untruth. Very imperfect human beings we are - unconsciously displaying our imperfections sometimes. Therefore, we all need help from Christ, the perfect One, who has commanded us to be perfect even as our Father in heaven is perfect (Matt. 5:48). Good enough, grace and truth came through Christ to us (v.17). Do you know we have received from Christ grace that teaches us to say no to ungodliness and worldly passions? (Titus 2:11,12) . Do you also know that we have received grace that helps us to reign through righteousness? (Rom. 5:21) . Know it that we can grow to a stage in our spiritual development where there is far more grace than ungrace, and far more truth than untruth (cf 1 Pet. 3:18). Waste no time to tap from Christ's fullness of grace (v.16), to receive power to exhibit such qualities of character that can be described as nearly perfect since only Christ is perfect.",
            "prayer": "Father, let the beauty of Jesus' character be seen also in me - now and evermore, Amen! ",
            "action": null
        },
        "2025-12-31": {
            "date": "2025-12-31",
            "season": null,
            "bibleText": [
                "Psalm 124:1-8"
            ],
            "topic": "ON A NOTE OF THANKSGIVING",
            "content": "On this last day of the year, we should pause to thank God and recognise that He has a track record of blessing us, providing for us, and protecting us. David in this psalm, considers what would have happened in the face of great enemy opposition against Israel if the Lord had not been on their side. He acknowledges God as their helper. So, he expresses grateful confidence in God who has provided escape both for him and his people. David concludes that help comes from the Lord, the great Creator. Beloved, let's look back to how the year 2025 began. If we are honest, we will reach the same conclusion with David that we would have been overwhelmed in the face of great enemy opposition if God had not provided escape from all our foes. Never mind if there are still heart desires of yours God has not attended to. As the year ends, resolve to rejoice in the LORD, the God of your salvation, \"Though the fig tree may not blossom, Nor fruit be on the vines; Though the labor of the olive may fail, And the fields yield no food; Though the flock may be cut off from the fold, And there be no herd in the stalls \"(Hab. 3:17-18). \"Rejoice in the Lord always. Again I will say, rejoice!\" (Phil. 4:4).",
            "prayer": "Dear Father, thank you for bringing me to the last day of the year. Take my hand now and lead me into a year I will yet overflow with thanksgiving, Amen! ",
            "action": null
        }
    }
}